{
  "summaries": {
    "[BitPet]  AI Integration in a Location-Based AR Game for Socialization and Physical Activity (2025/2026)": "This project investigates integrating Artificial Intelligence into BitPet, a location-based AR game promoting socialization and physical activity. Utilizing Unity for front-end development, the research will explore AI’s impact on gameplay and user engagement through features like dynamic interactions and personalized experiences. The project aims to enhance existing game mechanics and gather real-user feedback via testing. Expected outcomes include refined AI implementation and a strengthened player experience within the BitPet AR environment.",
    "[BitPet]  Empirical Study on the Physical and Social Health Effects of Playing BitPet (2025/2026)": "This master's project, “[BitPet],” investigates the physical and social health effects of a location-based AR game designed to promote activity and interaction. Utilizing data collection methods including questionnaires, interviews, and in-game analytics, the study will evaluate BitPet’s impact on player behavior and experience. The research draws inspiration from existing games like Tamagotchi and Pokémon GO. Expected outcomes include an assessment of BitPet's potential health benefits, identification of key game elements influencing engagement, and recommendations for designing similar exergames, contributing to theoretical frameworks in the field.",
    "[BitPet] AR Game to Motivation Socialisation and Physical Activity 2024/2025": "This master’s project develops an Augmented Reality (AR) game, “[BitPet],” to motivate socialization and physical activity through gamified mechanics. Utilizing Unity for front-end development, the project will explore existing game theory and technology alongside designing and evaluating a user-focused concept. The expected outcome is a commercially viable AR game promoting social interaction and exercise, supported by technical expertise from the BitPet team.",
    "[ExerGames] Multi-player pedal-game 2024/2025": "This project, “[ExerGames],” aims to develop a multi-player pedal-game prototype using Unity and an exercise bike API. The research focuses on existing exergames and designing a game that combines traditional button input with pedal movement for physical exercise and long-term engagement. Expected outcomes include a functional game prototype, evaluation through user experiments, and insights into the provided API’s suitability for exergame frameworks. Two students are required with Unity experience.",
    "[ExerGames] Exercise Bike Game Development and User Evaluation 2025/2026": "This project, “[ExerGames],” investigates integrating an exercise bike into game control using Unity. The research focuses on designing engaging exergames that leverage pedaling as a core mechanic to promote physical activity and user enjoyment. A prototype will be developed through user testing and experimentation to evaluate the game’s impact on motivation and exercise habits. Prior Unity experience is required for this team-based project supervised by Alf Inge Wang.",
    "3D oriented data augmentation for Deep Object Detection": "This project investigates 3D oriented data augmentation for deep object detection in marine applications, addressing limitations of traditional 2D augmentations. Utilizing depth estimation techniques (single image or motion stereo) from neural networks or video sequences, the research aims to realistically simulate weather conditions like fog, rain, and snow in 3D. The project will benchmark synthetic augmentations against real-world data through collaboration with DNV GL and NTNU’s marine sensor simulator. Expected outcomes include improved object detection network generalization performance and potentially extending to synthetic video generation, building upon previous work in fog/snow simulation.",
    "3D visualization of ship-breaking status and location of personnel": "This project investigates improving ship-breaking safety through 3D visualization. The research focuses on visualizing ship status and worker locations within shipyards to mitigate risks associated with relying solely on noise detection. Utilizing 3D modeling and prototyping, the student will design visualizations for real-time monitoring during different phases of the ship-breaking process. The project aligns with the SHEREC digitalization initiative, leveraging provided 3D models and incorporating user feedback to enhance worker safety and operational efficiency within this hazardous industry.",
    "[ExerGames] Play to get fit 2024/2025": "This project, “[ExerGames] Play to get fit 2024/2025,” investigates developing engaging exergames that balance fun gameplay with physical exercise. The research will explore game mechanics as motivators through theoretical study and prototype implementation using various technologies. The project involves a two-student team and aims to create and evaluate a functional exergame prototype, ultimately contributing to innovative approaches in the field of interactive fitness.",
    "[ExerGames] Play to get fit 2025/2026": "This project, “[ExerGames] Play to get fit 2025/2026,” investigates innovative exergames combining physical activity with engaging gameplay. The research will explore game-based motivation strategies alongside prototype development utilizing various technologies. A key outcome is a tested and evaluated exergame prototype assessing its effectiveness and player engagement. The project aims to create a fun and effective experience through a three-phase approach: research, development, and evaluation, requiring a two-student team.",
    "[Lecture Games] AI Multi-player Classroom Learning Games 2025/2026": "This project investigates the design and evaluation of an AI-powered multi-player learning game for classroom engagement. Utilizing game-based learning principles and incorporating artificial intelligence to enhance gameplay, the project will develop a collaborative or competitive educational experience. Key technologies include AI and game development platforms. Expected outcomes involve assessing the game’s effectiveness in knowledge acquisition and student motivation through user evaluations, ultimately demonstrating the potential of AI in interactive learning environments.",
    "A game engine based simulator framework for Otter USV  (in cooperation with Maritime Robotics, H2024-V2025)": "This project develops a game engine-based simulator framework for Otter USVs in collaboration with Maritime Robotics using ROS2. The core involves integrating Unreal Engine 5 or Unity with ROS2 to create realistic simulations leveraging camera (SeaSight) and LiDAR data transfer via ROS topics. The research focuses on simulating USV behavior and validating control systems. Expected outcomes include a functional simulation environment, enabling investigation of validation/verification methods and potential application for data generation and machine learning testing within the framework.",
    "A shift from old-school to cutting-edge – redefined homecare services delivery platform": "This project investigates transforming homecare services using a decentralized, user-owned health wallet platform within Trondheim municipality. Utilizing web and mobile applications, it leverages blockchain technology to enhance data privacy, security, and patient autonomy compared to traditional centralized systems. The research will employ interviews, surveys, and a pilot program to assess the feasibility and efficacy of this approach based on criteria like user satisfaction and operational efficiency. Expected outcomes include a proof-of-concept application demonstrating improved data control, transparency, and ultimately, a more patient-centric homecare service delivery model.",
    "A computer game to teach EU AI Act for the healthcare domain users": "This project investigates designing an educational computer game to teach the EU AI Act within the healthcare domain. Utilizing a design science research method, it will involve healthcare stakeholders in piloting and evaluating the prototype. The core technology focuses on game development for educational purposes. Expected outcomes include a functional game prototype and a methodology for creating similar AI Act education games, addressing the need to educate stakeholders regarding complex AI regulations in high-risk healthcare applications.",
    "AD (Autonomous Driving), AI/ML/DL and Computer Vision (CV) (2024)": "This master’s project explores autonomous driving (AD) utilizing AI/ML/DL and computer vision techniques within the NAP-lab’s AD platform. Research focuses on end-to-end approaches like imitation learning and reinforcement learning alongside modular AV systems incorporating NVIDIA DRIVE and ROS. Simulated environments (CARLA, NVIDIA DRIVE Sim, NeRF) and domain adaptation will be investigated, alongside real-world data integration with Karverket. Key areas include point cloud processing, Digital Road Twins, 5G remote control of AV fleets, and AD in challenging Nordic winter conditions. Expected outcomes involve advancements in realistic virtual environments and robust autonomous vehicle systems.",
    "AD - Visual Intelligence and accurate positioning on mobile devices": "This master’s project develops a mobile application utilizing AI and CPos positioning for accurate road object assessment in public transportation environments. The app integrates device cameras with centimeter-accurate positioning data to geo-reference conditions of road objects. Technologies include AI models and CPos corrections. Expected outcomes encompass HD-map creation, real-time image matching, and data collection for neural rendering applications, fostering collaboration between authorities and SINTEF across multiple counties/municipalities.",
    "AI - NeRF and Gaussian splats for mobility applications/ digital twin visualization": "This project explores utilizing NeRFs and Gaussian splats to create dynamic digital twins for mobility applications, specifically targeting autonomous vehicle development within a Nordic environment. The research will extend the Gløshaugen Digital Twin, visualizing realistic scenarios incorporating vehicles, pedestrians, and cyclists using Nvidia Omniverse and CloudXR for VR/AR simulation. Expected outcomes include AI techniques tailored to the environment and validation of algorithmic changes before deployment, ultimately accelerating traffic safety and efficiency in CAVs.",
    "AI and Game based learning (multiple projects)": "This thesis explores using AI to personalize mathematical learning through educational games, addressing the “cold start problem” by identifying student difficulties in real-time. Utilizing wearable sensors and Python/Java programming, the project will develop a feedback tool for adaptive support during gameplay. User studies will assess system usability and effectiveness, culminating in data analysis and a thesis documenting the findings. The expected outcome is an AI-driven learning system that optimizes mathematical education through interactive game experiences.",
    "Advancing Identity Security through AI": "This project investigates leveraging Artificial Intelligence (AI) to enhance identity security in response to growing digital fraud risks. The research will analyze existing identity verification methods and develop AI-powered systems for improved accuracy and efficiency compared to traditional approaches like passwords and biometrics. Key technologies include AI algorithms for identity verification. Expected outcomes involve designing, evaluating, and implementing robust AI-driven identity security solutions, ultimately aiming to protect personal information and mitigate identity theft.",
    "AFFINE TRANSFORMATION QUIZ": "This project investigates generating random affine transformation questions for examination purposes, a core topic in Visual Computing. Utilizing WebGL technology (OpenGL), the research aims to create an adaptable system suitable for online applications. The project leverages knowledge from courses like Visual Computing Fundamentals and Graphics & Visualization. Expected outcomes include a functional quiz generator and exploration of affine transformations within a web-based environment, supervised by Prof. Theoharis at NTNU.",
    "Agentic AI security vulnerabilities identification and mitigation": "This project investigates security vulnerabilities within Agentic AI systems, which leverage LLMs and agents for complex tasks. Recognizing increased attack surfaces due to these architectures (e.g., prompt injection), the research aims to systematize knowledge and develop identification approaches alongside mitigation countermeasures. Utilizing design science and a systematic literature review, the project will produce prototypes and methodologies for assessing and reducing Agentic AI risks. Technologies involved include LLMs and cybersecurity techniques.",
    "AI for knowledge work – how to succeed in practice?": "This master’s project investigates the practical application of AI in knowledge work, particularly within industries like fisheries and justice systems. Utilizing generative AI, the research will explore how AI tools align with existing workflows and support tacit, social knowledge production. The project involves a literature review and potentially an empirical study at DNV, collaborating with SINTEF Digital. Expected outcomes include understanding successful AI implementation strategies for diverse forms of knowledge work and informing tool design to enhance expert performance.",
    "AI for Mobile Robotics Systems:  Let us define a project after your own interests (H2024-V2025)": "This project explores applying Artificial Intelligence to mobile robotics systems, encompassing areas like deep learning, computer vision, and machine learning for planning & control. Research focuses on safety-critical AI, efficient architectures, and integrating physical knowledge into deep learning. Prototypes will be developed across diverse applications including autonomous racing cars, drones, and smart traffic infrastructure. Collaboration with industry partners ensures relevance to Qualification of AI-based Systems, Drone-based Inspection, and Autonomous Driving development. Expected outcomes include novel AI solutions and functional robotic prototypes.",
    "AI computer vision for Open Discovery  of Educational Augmented Reality Experiences": "This master’s project investigates using AI computer vision, specifically OpenAI’s CLIP or YOLOv5, to enable open discovery of educational augmented reality experiences. The research designs an architecture for object detection and similarity search within AR environments, evaluating its feasibility through a “pseudo experiment” with prepared test collections. It aims to interface with MirageXR, supporting visual search and environment tagging for applications like vocabulary learning and industrial training. Expected outcomes include a proof-of-concept implementation demonstrating adaptive AR tracking and the ability to identify both generic and specific real-world objects.",
    "AI for sustainable business models": "This project investigates leveraging Artificial Intelligence (AI) for sustainable business models (SBMs), addressing the challenges of transitioning to a triple bottom line in a carbon-constrained future. The research will explore how AI can enable data-driven decision making, quantify environmental impacts, and facilitate strategic value creation within firms. Key technologies include AI applications for risk management and opportunity identification. Expected outcomes involve understanding the relationship between AI, SBMs, and competitive performance, ultimately providing insights to accelerate sustainable business transitions and improve firm resilience.",
    "AI for understanding marine ecosystems by using underwater acoustic data": "This project investigates marine ecosystem understanding using underwater acoustic data to address challenges in sound identification and classification due to variability and noise. Utilizing AI models for analyzing large acoustic streams from ocean observatories, the research focuses on biophony and anthrophony analysis. Expected outcomes include effective classification models and insights into complex marine ecosystems, fostering collaboration with NTNU’s Department of Biology.",
    "AI-Based gaze-aware feedback system for programming  (multiple projects)": "This project investigates an AI-based gaze-aware feedback system for programming, utilizing eye-tracking data and IDE logs to provide real-time assistance to students. The research focuses on improving existing intelligent feedback systems for medium-sized software development challenges. Technologies include Python and machine learning. Expected outcomes involve designing, testing, and evaluating the system’s usability and effectiveness through user studies, culminating in data analysis and a thesis documenting the findings.",
    "AI-Driven Diagnostic Assistant for Medical Applications": "This project explores developing an AI-driven web application for medical diagnostics, leveraging artificial intelligence to analyze scintigraphy images, blood analysis data, and patient anamnesis. The student will focus on one or more of these areas, utilizing AI technologies for data visualization and complex diagnostic insights. Expected outcomes include a functional prototype demonstrating improved diagnostic capabilities and contributing to advancements in healthcare efficiency and patient outcomes through intelligent data analysis.",
    "AI in the classroom: Actively learning from student feedback during the lectures": "This project investigates student perceptions of lectures using data science techniques, specifically sentiment analysis and natural language processing. The research employs machine learning algorithms to analyze open-text responses from a potentially large dataset (few to hundreds of responses). The goal is to transform raw student feedback into actionable insights for improving teaching and learning practices. Expected outcomes include enhanced understanding of student experiences and the development of innovative methodologies to optimize lecture delivery and engagement.",
    "AI-based Fair Recruitment Systems": "This master’s thesis investigates fair recruitment systems using AI, addressing bias and transparency challenges within hiring processes. The project leverages machine learning (ML), specifically exploring feature weighting based on extracted data from past recruitment decisions, aligning with the BIAS project's “similar individuals” fairness approach. Utilizing a GDPR-compliant recruitment dataset, the research will automatically determine feature importance weights compared to human-provided values. Technologies include Python and potentially K-Nearest Neighbors (KNN). Expected outcomes are insights into objectively defining similarity for candidate evaluation and developing transparent, accountable AI hiring systems, contributing to ethical AI practices within HR.",
    "AI-based Environment Perception for Underwater Robots": "This project investigates AI-based environment perception for autonomous underwater robots, focusing on generating dynamic environmental models despite limited visibility and visual clutter caused by water conditions. Utilizing both classical computer vision and machine learning/deep learning methods, the research aims to evaluate suitable techniques for estimating ego-motion in this challenging scenario. The expected outcome is an empirically validated approach for robust underwater robot perception, contributing to the broader AROS project’s goal of autonomous snake robots.",
    "AI4Pathology - Digital pathology, self supervised learning": "This project, AI4Pathology, investigates the application of self-supervised learning for automated assessment of whole slide images (WSI) in lung cancer staging, a collaboration between hospitals. Utilizing modern segmentation architectures and patch-based classification, the research aims to develop novel ML techniques for lesion detection and prognostication from established WSI cohorts. The expected outcome is validated clinical applications for improved lung cancer diagnosis and stratification, leveraging digital pathology advancements.",
    "AI4TEE - Generative/diffusion models for ultrasound acquisitions (GE Vingmed Ultrasound)": "This project investigates utilizing generative AI models, including diffusion and GANs, to automate ultrasound image acquisition for cardiac interventions using GE Vingmed Ultrasound data. Research will focus on denoising, multi-modal synthesis, and 3D segmentation of structures like aortic valves and the mitral valve via U-Net or visual transformers. The goal is to improve surgical accuracy and patient safety through automated tracking and temporal consistency enforcement, ultimately leading to enhanced visualization tools for cardiac surgery.",
    "AI-lab pitched projects - Master-project Safari": "This master’s project explores diverse AI applications across healthcare, environmental monitoring, and maritime industries. Research areas include medical image analysis (AAA surgery prediction), satellite-based earth observation for nature loss monitoring, digital twin development for MIA Health, and predictive analytics for GNSS quality. Technologies utilized encompass artificial intelligence, laser scanning, DOP calculations, web viewers, and monocular depth estimation. Expected outcomes involve developing AI models for improved surgical decisions, optimized resource management, enhanced data visualization, and predictive capabilities within the fishing and maritime sectors.",
    "Applying NorLLM to enrich knowledge graphs describing municipal / public sector data-driven problems": "This project investigates utilizing the Norwegian large language model (NorLLM) to enrich a municipal knowledge graph built with RDF/OWL for Trondheim Kommune. The goal is to improve data search capabilities by leveraging NorLLM’s ability to identify synonyms and hypernyms within the Norwegian language. The student will evaluate three NorLLM models, comparing them against a non-Norwegian LLM, focusing on information retrieval tasks related to duplicate service/quality article detection and natural language querying. Utilizing a dataset of OWL/RDF data linked to “K-koder” and ODA methodology, the project aims to enhance semantic understanding and improve data access within the municipality’s complex service landscape.",
    "Architecture-based modeling of security aspects in evolving systems": "This master’s project explores architecture-based modeling to assess security within dynamic systems. The research focuses on developing techniques for representing and evaluating security considerations at the software architectural level. Key technologies likely involve UML, SysML, or similar modeling languages alongside security assessment methodologies. Expected outcomes include a novel modeling approach and improved methods for identifying and mitigating vulnerabilities in evolving software architectures.",
    "Artificial Intelligence in Business: Uncovering challenges and obstacles of adoption.": "This master’s project investigates the challenges and obstacles hindering Artificial Intelligence adoption within businesses. The research will analyze technological, organizational, and human factors impacting AI implementation, collaborating with the Big Data Observatory. Utilizing data analysis techniques, the project aims to uncover critical barriers preventing successful AI integration. Expected outcomes include identifying key challenges and proposing strategies for organizations to overcome them, ultimately informing practical applications of AI in business contexts.",
    "Artificial Intelligence in the Healthcare sector": "This project investigates the impact of artificial intelligence (AI) on healthcare professionals’ roles and experiences. Utilizing advanced analytics and machine learning techniques, it examines how AI is transforming diagnostic processes within radiology and automating repetitive tasks for nurses and administrative staff. The research aims to understand both the positive and negative consequences of these technological changes within the healthcare sector, ultimately contributing to a nuanced understanding of AI's evolving role in medical practice.",
    "Architecture-based reliability evaluation of machine learning pipelines": "This project investigates applying architecture-based reliability evaluation methods, like Fault Trees, to machine learning pipelines. Utilizing tools such as TensorBoard and Netron for pipeline visualization, the research will explore adapting existing techniques from traditional systems engineering to assess ML pipeline robustness against faults. The goal is to enable comparison of different architectures based on their tolerance to errors. Expected outcomes include a derived reliability model from a chosen pipeline diagram and contribute to defining methods for evaluating machine learning architecture resilience. Python and Git proficiency are required, alongside familiarity with probability theory.",
    "Artificial Intelligence and pair programming (multiple projects)": "This project investigates the factors contributing to successful pair programming using artificial intelligence. Utilizing eye-tracking, EEG, heart rate, and facial expression data from wearable sensors, students will develop prediction algorithms to measure programmer performance during collaborative sessions. The research employs Python and machine learning techniques to analyze interaction features. Expected outcomes include a comparative analysis of predictive algorithms and insights into the dynamics of effective pair programming, ultimately leading to improved understanding of collaborative coding success.",
    "Artificial Intelligence and Biometrics in Education (multiple projects)": "This project investigates utilizing AI and biometric data—including eye-tracking, EEG, heart rate, and facial expressions—to enhance learning experiences in education. The research will employ machine learning techniques (Python/Java) to analyze student physiological data for improved behavioral and performance predictions. Expected outcomes include developing predictive models based on combined biometric insights, ultimately leading to personalized learning strategies and a deeper understanding of student engagement.",
    "Automated indoor tasks assisted by rover like robots (continuation)": "This project investigates developing a system for rover-like robots to autonomously perform indoor tasks such as environmental monitoring and visual inspection. Utilizing dynamic mapping, navigation, mission planning, and fleet management, the prototype will enable robots to navigate buildings while avoiding collisions. Technologies include robotics, sensor integration, and potentially AI-powered scheduling. Expected outcomes are a functional prototype and user testing results demonstrating efficient autonomous task execution within a building environment.",
    "Automated scanning tool for Kubernetes": "This project develops an automated scanning tool for Kubernetes environments, collaborating with Norsk Helsenett to assess compliance with best practices. The tool will leverage existing frameworks like kube-bench and kube-hunter, focusing on configurations including RBAC policies, network policies, and admin rights. Utilizing Kubernetes, Linux, networking, and information security technologies, the project aims to provide a customized scanning solution for improved security posture within Kubernetes deployments. Expected outcomes include a functional scanning tool and enhanced learning in relevant areas.",
    "Autonomous Driving (AD): NAP-lab related projects based on Visual Intelligence (AI/CV)++ (2024)": "This Master’s project explores end-to-end autonomous driving utilizing AI/CV++ techniques within the NAP-lab at NTNU. Research focuses on simulating AD with NVIDIA DRIVE AGX Orin, CARLA, and NVIDIA Omniverse, alongside HD-map development via crowdsourcing and digital twins. Technologies include Neural Rendering, LiDAR, radar, GNSS, CAN-bus control, and DeepPrivacy2 for data anonymization. Expected outcomes involve testing E2E IL systems, neural reconstruction methods, and TeleDrive assistance solutions in both simulated and real-world environments, ultimately contributing to advancements in autonomous vehicle technology and potential PhD opportunities.",
    "Automated indoor tasks assisted by drones": "This project investigates the development of an automated indoor task system utilizing drones. The research focuses on dynamic environment mapping, autonomous navigation, mission planning, and fleet management for tasks like visual inspection and environmental monitoring (temperature, humidity). Technologies include drone control systems and potentially SLAM algorithms. Expected outcomes are a functional prototype and user testing results demonstrating efficient drone-assisted indoor task execution, suitable for collaborative student development.",
    "Autonomous Ferry -- Projects in AI-based Perception in Cooperation with Zeabuz (H2024-V2025)": "This project explores AI-based perception for autonomous passenger ferries in collaboration with Zeabuz. Research focuses on environment understanding through stereo vision, object detection (visual/infrared), motion planning, and reinforcement learning for safety validation. Technologies include AI, infrared imagery, simulation, and potentially wake modeling. The expected outcome is the development of robust perception systems to support autonomous ferry operation, directly contributing to Zeabuz’s technology advancements under the supervision of Prof. Rudolf Mester.",
    "Biometrics and Neuro-conceptualization": "This project investigates how the brain processes visual conceptual models (UML, BPMN) using biometric data – heart rate, EEG, and eye-tracking. The research combines neuroscientific approaches with IT fields like NeuroIS and NeuroSE to explore model comprehension from a cognitive perspective. Key areas include individual differences in model processing and optimal modeling techniques. Expected outcomes involve establishing a framework for understanding brain processes related to conceptual models and generating material suitable for scientific publication. Technologies utilized will encompass biometric data analysis and experimental design.",
    "Cities as Urban Living Labs": "This project investigates Urban Living Labs as a citizen-centric approach to designing urban services. The research will establish a small-scale Living Lab, potentially focusing on areas like health & well-being (SWELL), utilizing co-creation methods and data evaluation techniques. Expected outcomes include establishing a functional Living Lab prototype and validating its methodologies. The project explores engaging citizens in service design through iterative feedback processes, aiming to create responsive urban solutions within the NTNU or Trondheim city environment.",
    "Bærekraftsrapportering (sustainability reporting)": "This master’s project investigates challenges in sustainability reporting under the new EU Corporate Sustainability Reporting Directive (CSRD). The research focuses on collecting, processing, and reporting sustainability data, particularly scope 3 emissions, for renewable energy company Aneo AS. Utilizing CSRD guidelines, the project addresses ambiguities regarding “bærekraft” definitions and relevant data. Expected outcomes include solutions for navigating these complexities and fulfilling stricter reporting requirements. Technologies involved will support data analysis and reporting aligned with EU standards.",
    "Characterization of marine detectors in a situation awareness context": "This project investigates characterizing marine object detectors (ships) utilizing video, radar, and LiDAR sensor modalities within a situation awareness context. The research focuses on abstract representation and statistical performance quantification for system simulation, rather than specific algorithm implementation. Technologies include video, radar, and LiDAR data processing. Expected outcomes are an abstract sensor model enabling complex system simulations, addressing challenges posed by variable operational conditions like weather and visibility in collaboration with DNV.",
    "Chop my Chip! Dynamic Compilation Targets for Hardware-Software Codesign": "This project investigates dynamic compilation targets for RISC-V hardware-software codesign using LLVM. The research addresses the challenge of adapting compilers to evolving processor designs by enabling designers to define custom ISA features during early development. Utilizing C/C++ and Python, the project aims to dynamically recompile programs across diverse RISC-V variations, assessing performance impacts for applications like autonomous driving or cryptography. Expected outcomes include a modified LLVM compiler toolchain and insights into optimal vector instruction selection for specialized hardware acceleration. Collaboration will occur with the University of Bologna and Politecnico di Milano.",
    "Classroom interaction tools": "This master’s project investigates interactive tools for large classrooms, exploring scenarios like group work and quizzes. Research involves literature review and user testing to generate data for analysis and interpretation. Potential development includes data processing scripts and novel visualizations. The project aims to identify useful results and conclusions regarding classroom interaction strategies. A collaborative approach is recommended for optimal outcomes.",
    "CNNs applied to reverse engineering of unknown instruction set architectures and custom virtual machines": "This project investigates applying convolutional neural networks (CNNs) to reverse engineer unknown instruction set architectures (ISAs) and custom virtual machines. The research aims to automatically detect ISA features from binary images – word size, register sizes, etc. – using trained CNNs. Successful implementation could significantly accelerate the disassembly process and enable recovery of instruction and control flow information. Expected outcomes include a demonstration of CNN efficacy in feature detection and potential tools for reverse engineering systems with undocumented ISAs or custom VMs.",
    "Classifying animals in the wild": "This project investigates automated animal classification in complex wild environments using deep learning techniques. The research focuses on labeling both animals (elk, rabbit, deer) and their surroundings (snow, grass, trees) from datasets like EE, SW, SS, CC, and the Norwegian wildlife dataset. The goal is to develop robust models for identifying animal species and background elements within challenging photographic conditions. Expected outcomes include a trained deep learning system capable of accurate classification and contributing to improved wildlife monitoring efforts.",
    "City learning": "This project investigates “City Learning,” exploring how cities can evolve through continuous learning and adaptation to transformations like digitalization. The research will develop a tool – potentially a game or card system – based on a theoretical city learning model to support urban stakeholders in aligning with change. Utilizing literature review and iterative design, the project aims to create a practical resource for cities to foster ongoing evolution and innovation within their communities.",
    "Collaborative Games for IT and Sustainability": "This project explores using collaborative games to educate students on the impact of IT – both positive and negative – regarding UN Sustainable Goals. The work involves game design, prototyping, and evaluation, leveraging technology choices determined by student interests (genre & specific goals). Building upon existing group research, it aims to increase awareness and promote sustainable practices within computer science education. Expected outcomes include a playable game prototype and insights into effective educational gaming strategies.",
    "Combining EEG and motion capture in immersive VR environment": "This project investigates combining electroencephalography (EEG) with motion capture using HPE for immersive VR environments, particularly in rehabilitation contexts. The research aims to provide holistic feedback based on attention levels and movement intention tracked via Unity and integrated with EEG data synchronized through tools like Neuropype or Timeflux.io. Expected outcomes include a functional VR exergame demonstrating the combined use of brain and body signals for improved patient feedback and progress monitoring, leveraging existing Vizlab resources and equipment.",
    "Constructing an AI-based, intelligent ground vehicle, level II": "This project develops a level II AI-based mobile robot utilizing the Agilex.ai LIMO platform, focusing on cooperative interaction in dense environments with potential human interaction. The research will implement intelligent components like vision using state-of-the-art methods, prioritizing behavior and autonomy over speed. A secondary robot may be acquired to facilitate simulation. Expected outcomes include a functional robot capable of tasks such as collision-free navigation or package delivery, demonstrating intelligent control and perception capabilities through software development.",
    "Comparing gaze input methods with traditional mouse input for typical tasks": "This project investigates the comparative performance of gaze input devices versus traditional mice for common tasks like web browsing and coding. Utilizing eye-tracking technology and user testing, the study will analyze efficiency across various applications. Expected outcomes include data analysis, potentially involving custom scripts and visualizations to determine optimal combinations of gaze and mouse interaction. The research aims to inform design choices regarding alternative input methods.",
    "Compilers for Differential Algebraic Equations": "This project investigates compilers for Differential Algebraic Equations (DAEs) to improve the scalability of simulation translation from declarative models. Utilizing MLIR technology, the research will develop a new compiler with optimized C++ reference translations and benchmark suites. The goal is to address limitations in current automatic translation algorithms when dealing with large state variables within equation-based modelling languages. Expected outcomes include a scalable DAE compiler and enhanced system simulation capabilities through international collaboration with Politecnico di Milano.",
    "Compilers for Approximate Computing": "This project investigates compilers for approximate computing, specifically precision tuning techniques to optimize performance and energy consumption in applications. Utilizing C/C++ with CMake and Git, it explores modifying data types (e.g., floating-point to fixed-point) within the compilation process. The research involves code analysis, transformations, and verification, potentially leveraging LLVM-IR or MLIR. Collaboration will occur with Politecnico di Milano and University of Bologna. Expected outcomes include a functional compiler prototype and enhanced understanding of approximate computing methodologies for improved hardware efficiency.",
    "Crowdsourcing using Geographical Information Systems": "This project investigates leveraging Geographical Information Systems (GIS), specifically ARCGIS, for a crowdsourcing platform to enhance place knowledge through shared narratives. Utilizing Large Language Models (LLMs) alongside an open-source GIS application, the research will prototype content analysis and validation. The aim is to create a system that captures location-specific stories and experiences, contributing to a richer understanding of places. Expected outcomes include a functional prototype and exploration of LLM applications within a crowdsourced GIS environment.",
    "Data science - in practice": "This master’s project investigates the practical application of data science techniques within organizational settings, specifically addressing why adoption lags behind interest. The research will explore conditions for consequential decision-making using empirical cases like the energy sector and healthcare, focusing on algorithmic accountability and explainability (XAI). Technologies involved include data science methodologies and potentially XAI tools. Expected outcomes are an enhanced understanding of factors driving data science implementation and contributing to the NorwAI project’s goals.",
    "Continuous software delivery utilising PaaS: opportunities and challenges": "This project explores the adoption of open-source Platform-as-a-Service (PaaS) solutions like Red Hat OpenShift and AWS Lambda within IT organizations. It investigates how effectively these platforms support software developers’ migration to cloud infrastructure, examining use cases from companies such as NAV and Finn.no. The research will analyze the rationale behind PaaS adoption and assess the potential benefits for wider organizational application. Expected outcomes include insights into challenges and opportunities associated with open-source PaaS implementation, informed by existing literature on cloud computing adoption.",
    "Contextualising data on the OSDU data platform": "This project investigates utilizing Active Knowledge Models (AKM) and role-specific workspaces within the OSDU® Data Platform to contextualize data for specific upstream oil & gas tasks. The research explores smart contextualisation algorithms and aims to automate workflows by linking analyses back to original datasets. Utilizing a case study with Equinor, the project will develop AKM models and import schemas from the platform. Expected outcomes include improved data discovery, knowledge transfer across industries, and enhanced automation potential within the OSDU ecosystem.",
    "Define your own project in Visual Computing": "This open-ended Master’s project in Visual Computing allows students to develop a project based on their interest and prior coursework (TDT4195 & TDT4230). Students will be selected based on proposal suitability and performance. The research area is flexible within Visual Computing, utilizing relevant technologies – likely including computer vision, image processing, or 3D graphics – to achieve specific outcomes determined by the student’s chosen project scope.",
    "Define your own topic in software and system reliability": "This Master’s project explores software and system reliability, safety, or security, with a focus on topics like architectural modeling, formal methods (e.g., model checking), fault injection, and testing. The student will collaborate with Leonardo Montecchi to define a specific research area suitable for a Master's level investigation. Expected outcomes include the development of analyses, models, or tests related to reliability/safety/security properties within software systems.",
    "Designing a next generation user identities platform using web 3.0 technologies": "This project proposes designing a next-generation user identity platform leveraging Web 3.0 technologies, specifically self-sovereign identity and digital wallets. The research focuses on creating a secure mobile and web platform for storing and managing diverse identity documents like licenses and diplomas. Key technologies include encryption and biometric authentication to ensure privacy and security. Expected outcomes include a user-friendly, centralized digital wallet solution reducing reliance on physical copies and streamlining document access while offering automated renewal reminders. Stakeholder input and pilot testing will drive platform development and wider adoption.",
    "Design and Evaluation: A digital tool to empower children to self-report their emotions and learning": "This project aims to develop a digital tool, potentially web-based using HTML, CSS, JavaScript, and Python, to enable children’s self-reporting of emotions during design thinking activities. Inspired by the EmoForm tool, the research will iteratively improve a digital interface for capturing emotional data in real-time. The expected outcome is an evaluated tool through a user study within the LCI Lab, Trondheim.  The project focuses on interaction design and UX research, with deliverables including literature review, tool development, user testing, and thesis writing.",
    "Design Thinking learning with Emerging Technologies": "This project investigates enhancing design thinking learning experiences for young learners using emerging technologies and online learning tools. The research focuses on developing a learning analytics dashboard utilizing data like eye-tracking and interaction metrics to assess cognitive, affective, and physiological states. Key technologies include Javascript and data visualization techniques. Expected outcomes involve iteratively developing and testing a system through user studies, culminating in a thesis documenting the findings and recommendations for improved design thinking education with technology integration.",
    "Design and prototyping workshops as collaborative learning activities": "This project explores using in-person workshops – including hackathons and summer schools – as collaborative learning activities for sustainable cities education. The research will investigate combining lectures, ideation, and prototyping to equip college students with multidisciplinary skills. Activities may include literature reviews, case studies through observation, and designing new workshop tools. Expected outcomes involve developing novel methods to enhance student engagement and skill development in addressing urban sustainability challenges.",
    "Development of functionality for requesting and assigning substitute teachers in the Visma Inschool Mobile App": "This project aims to enhance the Visma Inschool Mobile App by developing a feature for teachers and principals to request and assign substitute teachers directly via mobile devices. Utilizing agile methodologies, the development will involve user interface design, suitable programming languages (details unspecified), and cross-functional team collaboration. The expected outcome is a fully tested and implemented mobile feature improving efficiency and usability of the app. Students will gain experience in software development, mobile app design, testing, implementation, and stakeholder communication within a project management context.",
    "Digital registrering av innemiljø og tilstedværelse på Campus": "This project investigates the use of indoor environmental sensors for presence detection within Campus spaces, aligning with the broader “Smart workplaces past Covid-19” initiative involving Mazemap and Cisco. The research explores sensor data to identify optimal applications for in-situ monitoring of climate and occupancy. Technologies involved include various environmental sensors. Expected outcomes encompass valuable insights for optimizing building design and operational strategies, contributing to sustainable urban development efforts within the FME-ZEN project.",
    "Development and maintenance of IT-systems in Norwegian Organization": "This project analyzes ongoing data from yearly surveys (2015-present) investigating IT system development and maintenance within Norwegian organizations, building upon previous studies conducted since 1993. Utilizing quantitative and qualitative data alongside a literature review, the research aims to identify mechanisms influencing resource utilization for information systems support. The expected outcome is new knowledge informing scientific publications and providing insights into organizational practices related to IT system management.",
    "Development of ´Learn and Earn/Learn to Care’ like gaming platform using mix of Web3 and traditional gaming Technologies": "This project develops a multi-player gaming platform leveraging Web3 technologies alongside traditional game development techniques. The aim is to create an interactive environment where players can learn, earn digital assets, and compete through games like fencing or racing. Research will focus on architectural differences between traditional and Web3 game development, user onboarding challenges within Web3 games, scalability concerns, and security implications of public smart contracts. Expected outcomes include a functional gaming platform and insights into integrating Web3 elements for enhanced player engagement and reward systems.",
    "Digital Technologies for “placemaking” and “placekeeping”": "This project investigates leveraging digital technologies to enhance “placemaking” and “placekeeping,” focusing on creating meaningful connections within public spaces. Utilizing participatory methods and user interaction, the student will explore solutions like Augmented Reality or digital storytelling to foster community wellbeing and emotional attachment to locations. The anticipated outcome is a prototyped digital solution designed to facilitate shared experiences and ensure the preservation of place identity through narrative engagement.",
    "Digitalisering i olje og gass - IoT": "This project investigates leveraging Internet of Things (IoT) technology for enhanced decision-making in Norwegian offshore oil and gas extraction. The research focuses on utilizing sensor data – including temperature, pressure, and geological properties – from unreliable subsea equipment with limited lifespans. Key technologies include IoT deployment and IT tools to mitigate uncertainty and improve operational reliability. Expected outcomes involve developing strategies for informed decisions despite sensor limitations, ultimately optimizing exploration, drilling, and production processes within the challenging deep-water environment.",
    "Education in the era of generative AI: Understanding the potential benefits of ChatGPT in teaching and learning": "This project explores the potential of ChatGPT in education through a case study investigation. Research focuses on understanding the benefits and challenges presented by generative AI tools like ChatGPT for teaching and learning practices. The study will examine how these evolving AI tools can be safely and constructively leveraged to improve educational outcomes and support student learning. Key technologies include ChatGPT, with expected outcomes encompassing recommendations for integrating generative AI into education effectively.",
    "Digital Twins (DTs) for Health and Infrastructure++ (2024)": "This project investigates the application of Digital Twins (DTs) for optimizing both healthcare management and road infrastructure decisions. Utilizing DT technology, the research aims to enable self-management capabilities and provide enhanced decision support systems. The specific technologies employed are yet to be detailed, but the anticipated outcome is a demonstrable framework for improved operational efficiency and proactive maintenance strategies within these sectors.",
    "Diversity Equity and Inclusion (DEI) in software development": "This master’s project investigates diversity, equity, and inclusion (DEI) practices within Norwegian software development, examining identity-related factors like gender, race, and neurodiversity. Utilizing empirical software engineering methods, the research will analyze company practices, team diversity, and product disclosures through interviews, TDT4290 course material analysis, and workshops. The goal is to identify effective guidelines for disclosing diversity in software development processes and understand its impact on teams. Expected outcomes include validated findings and recommendations informed by existing literature on team composition, implicit bias, and human-computer interaction.",
    "Driving with NeRFs: Simulating sensor inputs for autonomous driving agents": "This project investigates utilizing Neural Radiance Fields (NeRFs) and 3D Gaussian Splatting to enhance the nuPlan simulator for autonomous driving. The research aims to synthesize realistic camera inputs on-demand, addressing limitations in existing simulators like CARLA and NuScenes. Key technologies include NeRFs/Splatting and nuPlan. Expected outcomes involve exploring the integration of these view synthesis methods to enable closed-loop simulation and evaluating their potential for training and assessing end-to-end learned driving systems through novel camera input generation.",
    "Efficient assembly of software MVPs through reuse of services and components": "This project investigates efficient software MVP assembly through service and component reuse, collaborating with a company to reduce development time. The research focuses on abstracting customization patterns and utilizing design-time views (e.g., Figma) for prototyping. A prototype tool will be developed to assemble existing components and import services, demonstrating a proof of concept. Expected outcomes include methodologies for reusing services and components, ultimately accelerating MVP generation within the company’s context.",
    "Emotions and well-being in Computing education": "This project investigates the impact of emotions on well-being and learning within computing education. Utilizing literature review and potentially student interviews (IDI), the research aims to understand current needs and explore opportunities for intervention. The project may culminate in the design of a lightweight tool – such as a game – to enhance students’ awareness of their emotions during learning, ultimately fostering creativity and improved decision-making.",
    "EduWallet: A Blockchain-Enabled Digital Wallet for Managing University Course Credits": "EduWallet leverages blockchain technology to transform university credit management through seamless integration with Blackboard and Inspera APIs. The project develops a secure digital wallet for tracking course credits, facilitating efficient transferability, and automating enrollment processes via smart contracts. Key features include real-time verification, token-based incentives, and an analytics dashboard. Expected outcomes involve improved student mobility, reduced administrative overhead, and enhanced academic record accuracy through blockchain’s immutable ledger.",
    "Effects of Interpreted Languages on Microarchitectural Performance": "This project investigates the impact of interpreted languages (Python, JavaScript, PHP) on microarchitectural performance within modern processors. The research focuses on understanding how runtime interpretation affects hardware utilization – specifically caches, branch prediction, and prefetchers – due to the differing treatment of code versus data by the processor. Utilizing a novel tool designed to track data flow through the computing pipeline, the project aims to identify inefficiencies and propose optimization methods for improved performance and energy efficiency in FaaS workloads. Expected outcomes include insights into hardware adaptation strategies for interpreted languages and recommendations for cloud computing infrastructure design.",
    "Employee-driven digital transformation": "This project investigates employee participation in digital transformation initiatives, addressing the common issue of top-down approaches leading to failed projects. The research will analyze successful and unsuccessful attempts, identifying challenges and recommending best practices for future digitalization. Utilizing empirical qualitative research methods, it aims to understand organizational perspectives on digital transformation. Expected outcomes include a framework for incorporating employee knowledge and skills into effective digital transformation strategies, ultimately reducing project costs and increasing success rates.",
    "Enhancing Online Laboratory Simulations Through AI-Powered Learning Analytics": "This project investigates enhancing online laboratory simulations for STEM education using AI-powered learning analytics. Utilizing Articulate Storyline 360, the research will develop models to track learner engagement and performance within simulations, generating insights into skill acquisition and trends. The anticipated outcome is actionable data informing real-time interventions and improved instructional design strategies to optimize student outcomes in online STEM learning environments.",
    "Evaluating the Role of Gamified Simulations in Enhancing Learner Motivation and Retention": "This project investigates the impact of gamified simulations using Articulate Storyline 360 on learner motivation and retention. The research incorporates adaptive AI mechanics for personalized learning experiences within simulation-based environments. Key outcomes include assessing learner engagement and tracking performance to determine the effectiveness of gamification in addressing challenges within online education. The study aims to demonstrate how these simulations can promote deeper learning through enhanced motivation and optimized knowledge retention.",
    "Empowering Children’s STEM Learning through Embodied Interaction and GenAI capabilities": "This project investigates empowering children’s STEM learning through embodied interaction and GenAI (LLMs, Multimodal LLMs). The research will explore Motion-Based Technology (MBT) alongside adaptive learning models within a multisensory environment, focusing on math education. Students will develop interactive systems suggesting activities based on learner data. Expected outcomes include identifying key MBT analytics, creating technological interfaces, and evaluating their effectiveness. Technologies utilized encompass Python/C#/JavaScript programming, LLM integration, and multimodal data analysis. Collaboration occurs with LCI Lab and UC Berkeley’s EDRL lab.",
    "Enterprise Architectures for learning and knowledge transfer in sustainable cities": "This project investigates applying enterprise architecture to facilitate learning and knowledge transfer in sustainable cities. Utilizing digital ecosystems, sensor data, and ICT systems, it aims to develop an enhanced enterprise architecture model supporting replicable city solutions. The research will prototype and validate this model, focusing on capturing and transferring best practices across urban environments. Relevant technologies include information modelling and Enterprise Architecture, aligning with the TDT4252 and TD20 specializations. Expected outcomes are a validated model for sustainable knowledge transfer within cities.",
    "Ethical aspects of AI/recommender systems": "This project investigates ethical considerations within AI and recommender systems, specifically focusing on privacy, fairness, and bias from a technical perspective. The research aims to translate social science concepts into mathematical models for implementation in AI systems. Utilizing references on AI bias detection and mitigation, the project seeks to evaluate approaches promoting equitable outcomes. Expected outcomes include developing methods for assessing and addressing bias within recommender system algorithms, contributing to more responsible AI development.",
    "FACIAL LANDMARK DETECTION": "This project investigates 2D facial landmark detection for applications like expression transfer. It will involve surveying existing techniques and implementing a selected approach using Python or C/C++. The research leverages visual computing fundamentals (TDT4195 & TDT4230) and aims to demonstrate the practical utility of accurate landmark detection. Expected outcomes include a functional implementation and exploration of potential applications within the field.",
    "Fake News (Disinformation) Detection": "This master’s project investigates methods for detecting fake news (disinformation) within online sources like social media and news outlets. Utilizing techniques including machine learning, natural language processing, and potentially semantic web technologies, the research aims to develop an efficient system for distinguishing between real and fabricated news. The expected outcome is a demonstrable approach for identifying disinformation, contributing to improved information literacy and combating the spread of false narratives.",
    "Exploring the black box of AI Governance": "This project investigates AI governance practices within organizations, examining their development, deployment, and impact on business and project performance. The research explores how organizations address ethical and regulatory frameworks alongside delivering business value through AI. It seeks to understand organizational approaches to establishing AI governance processes and their resulting outcomes. Technologies involved will likely include data analysis and potentially qualitative methods for stakeholder interviews. Expected outcomes include insights into effective AI governance strategies and their influence on project success.",
    "Eye-tracking and training novice programmers  (multiple projects)": "This project investigates using eye-tracking data to improve novice programmer debugging through an “Expert’s Movement Mapping Examples” system. The research focuses on analyzing expert programmers' gaze patterns via dialogue and gaze input, utilizing Python or Java for tool design and implementation. Expected outcomes include a usable gaze-enabled feedback tool validated through user studies – initially small, then larger – culminating in data analysis and a thesis documenting the effectiveness of this approach to novice programming assistance.",
    "Fighting Bias in Large Language Models": "This project investigates bias within large language models (LLMs), a critical area of AI research due to their prevalence. The research focuses on identifying, quantifying, and mitigating demographic biases related to gender, identity, and cultural backgrounds. Technologies explored include biased datasets and algorithmic modifications for fairer representation. Expected outcomes involve improved dibiasing methods and a refined definition of bias itself, ultimately contributing to more equitable and reliable LLM development.",
    "Flexible data visualization in a VR environment to aid the assessment of visuospatial neglect using eye tracking": "This project investigates visuospatial neglect in post-stroke patients using a VR environment with integrated eye tracking. The research aims to develop flexible data visualization tools within the VR system, utilizing Python for generating gaze plots and analyzing fixation/saccade data. Low-cost VR headsets and a custom virtual environment will be employed. Expected outcomes include enhanced clinical assessment through real-time visualization of eye movement data directly within the VR setting, facilitating deeper understanding of neglect mechanisms and improving diagnostic capabilities in everyday patient scenarios. Collaboration occurs with St. Olav’s Hospital's Department of Acquired Brain Injury.",
    "Generativ kunstig intelligens i programmering": "This project explores the application of generative artificial intelligence in programming and software development. The research focuses on utilizing AI-powered chatbots to assist programmers, particularly within a learning context. Key areas include evaluating AI code generation for learning outcomes and assessing its potential in automated assessment feedback. Technologies involved encompass generative AI models and chatbot development. Expected outcomes involve testing diverse solutions and providing student-driven proposals for integrating generative AI into programming education.",
    "FlexEEG decoding of hand movement intention": "This project investigates decoding hand movement intentions from EEG signals using low-density EEG and source reconstruction techniques combined with machine/deep learning algorithms. The research aims to develop classifiers for neurorehabilitation feedback and brain-computer interfaces controlling external devices. Utilizing recorded EEG data and a game interface, the project builds upon preliminary findings published in *Scientific Reports*. Expected outcomes include a foundation for wearable solutions enabling real-time movement decoding and potential applications in therapeutic interventions and assistive technology.",
    "GENERATING SURFACES FROM FIELDS": "This project explores efficient surface generation techniques from signed distance fields (SDFs) and ray fields like MARF. The research will investigate alternative methods to the computationally expensive marching cubes algorithm for extracting surfaces from SDFs and their gradients, starting with genus 0 objects. Utilizing Python and C/C++, the project aims to develop novel approaches for rendering hardware. Expected outcomes include optimized surface extraction algorithms and potentially improved rendering performance.",
    "Game for reflection on ethical aspects of IT tools": "This project proposes developing and evaluating a mobile game to promote reflection on ethical issues surrounding IT tools, including algorithmic bias and data privacy. Utilizing game development technologies for interactive learning, the project builds upon previous work in sustainability education. The anticipated outcome is a tool for facilitating discussions within events, workshops, and courses, addressing complex ethical considerations arising from increasingly pervasive digital technologies.",
    "High quality interactive digital twins in VR": "This project explores the creation of high-quality interactive digital twins within a Virtual Reality (VR) environment. Utilizing data and simulation, it aims to develop VR interfaces for visualizing and interacting with digital twins of complex systems like autonomous aquariums or electrical cable overload prevention experiments. The research will leverage VR technologies alongside digital twin methodologies, collaborating with the Institute of Cybernetics. Expected outcomes include a functional VR environment facilitating real-time monitoring, optimization, and informed decision-making based on the digital twin data.",
    "Human-Centered AI for Responsible Digital Transformation": "This project explores human-centered design of AI systems within digital transformation across sectors like healthcare or education, utilizing methods including surveys, interviews, and prototyping. Research investigates stakeholder engagement, policy implications, and innovative technical designs – potentially involving machine learning or IoT technologies. The goal is to develop responsible digital transformation strategies prioritizing human values and business value. Expected outcomes include insights into organizational strategy, user interaction design, or policy-making related to AI implementation, aligning with research on responsible innovation and human-centered AI principles.",
    "Git dashboard": "This project proposes a Git dashboard to provide educators with an overview of student projects utilizing Git for collaborative development. Leveraging Git APIs and potentially incorporating static or dynamic analysis, the dashboard will offer insights into project status and information. The aim is to improve faculty oversight within an educational setting, building upon previous related projects. Technologies involved include Git and data analysis methods, with expected outcomes being a streamlined system for monitoring student progress.",
    "Health information systems in developing countries": "This master’s project investigates the use of Health Information Systems (HIS), specifically DHIS2, in developing countries to improve healthcare efficiency and reporting. Utilizing open-source software, the project focuses on pragmatic implementation across 80+ countries via mobile technology – leveraging widespread mobile phone access despite infrastructure limitations. Research involves fieldwork in Africa or Asia to identify requirements for Hisp’s evolving portfolio. Expected outcomes include contributing to the ongoing development of DHIS2 and enhancing health service delivery within underserved populations.",
    "Hybrid co-design toolkits": "This project investigates adapting co-design methodologies for hybrid digital environments following the COVID-19 pandemic. Research focuses on reimagining interaction strategies within co-design workshops utilizing tools like Zoom, Miro, and Teams. The project will involve a literature review, framework development, and prototype creation of hybrid toolkits based on case studies. Expected outcomes include a comparative understanding of diverse co-design approaches and practical toolkit solutions for facilitating inclusive design processes in remote/hybrid settings.",
    "ICT for Health & Well-being in Built Environments": "This project investigates the application of ICT to enhance health and well-being within sustainable built environments as part of the SWELL project. Research will encompass a literature review of ICT’s impact, exploration of interactive digital technologies, and prototyping user engagement solutions for physical spaces. The project aims to design and evaluate a prototype, ultimately contributing to the development of healthier and more supportive built environments through innovative technology integration.",
    "Investigating and comparing alternatives to the Eclipse Modeling Framework (EMF)": "This project investigates alternatives to the Eclipse Modeling Framework (EMF) for Model-Driven Engineering, considering evolving development trends like machine learning and web applications. It will analyze tools such as Langium and PyEcore, exploring their suitability alongside frameworks like MLIR. The research involves comparing these platforms on standardized scenarios to assess their metamodeling capabilities and language infrastructure features. Expected outcomes include a comparative analysis of EMF alternatives and recommendations for applying MDE techniques in modern development contexts utilizing Java, Python, and potentially other languages.",
    "Hybrid human‐AI learning technologies": "This project investigates hybrid human-AI learning technologies, exploring augmentation and collaborative design of learning services. Utilizing the six levels of automation model, it identifies roles for learners and teachers within AI-enhanced educational systems. The research focuses on designing interfaces and artifacts to address challenges and opportunities presented by this approach. Expected outcomes include articulating control transitions between humans and technology, ultimately contributing to a deeper understanding of effective hybrid intelligence in education.",
    "Innovative education at the intersection of XR and ChatGPT": "This project investigates innovative education through the integration of XR (VR/AR/XR) and generative AI (ChatGPT, Midjourney, Sora). The research aims to develop virtual classrooms with ChatGPT-powered teaching assistants for personalized learning experiences at NTNU. Utilizing the IMTEL VR lab’s extensive equipment, the project will explore creating 3D educational content rapidly without prior programming expertise. Expected outcomes include evaluating virtual classroom effectiveness and assessing the impact of AI on generating educational resources, addressing a key barrier to XR adoption among educators.",
    "Integrating AI Chatbots into Articulate Storyline 360 for Scaffolding Online Learning": "This project investigates integrating AI chatbots into Articulate Storyline 360 simulations for personalized online learning. The research focuses on utilizing conversational AI to provide real-time scaffolding and analyze learner interactions within the platform. Key technologies include Articulate Storyline 360 and an AI chatbot. Expected outcomes involve evaluating chatbot effectiveness in addressing learner challenges, improving learning outcomes, and providing insights into leveraging conversational AI to enhance online educational experiences.",
    "Investigations on Situation Awareness Systems for an Autonomous Ferry (H2024-V2025)": "This project investigates Situation Awareness Systems for an autonomous ferry in collaboration with Zeabuz. Research focuses on AI-driven processing of sensor data to create dynamic environmental representations for safe navigation and collision avoidance. Technologies explored include machine learning and statistical modeling techniques. The project builds upon prior MSc work, aiming to develop a robust system enabling complex maneuvers like docking. Expected outcomes involve a validated approach to situation awareness utilizing sensor data for autonomous ferry operation.",
    "Large-scale agile software develpment": "This master’s project investigates the adaptation of agile software development practices in large-scale projects, examining frameworks like Scaled Agile Framework and Large-Scale Scrum. The research will begin with a literature review, potentially expanding to an empirical study analyzing successful implementations from projects including DNV GL and Equinor. Key technologies explored include Scrum, Spotify Model, and Disciplined Agile Delivery. Expected outcomes involve understanding how agile methodologies are effectively scaled for complex software development, contributing to improved project management within large organizations.",
    "Investigating LLMs for model-to-model transformation tasks": "This project investigates using Large Language Models (LLMs) like ChatGPT to automate model transformation tasks in software engineering, specifically generating code for manipulating graphical models from UML diagrams. The research will utilize publicly available LLMs and datasets, focusing on experimentation with data tuning and pre-processing. Utilizing Python and Git, the goal is to explore LLM generalization for creating model transformations from examples, ultimately aiming to build an LLM-based model transformation engine. Expected outcomes include a deeper understanding of LLM applicability in MDE and potential advancements in automated code generation.",
    "Learning about AI in schools": "This project investigates the current introduction of AI in schools (lower & upper secondary) through curriculum and extracurricular activities. The research will inform the design of an engaging, playful intervention focused on responsible and sustainable AI practices. Technologies explored may include educational software and interactive learning tools. Expected outcomes include a prototype intervention promoting student engagement and understanding of ethical considerations within AI development and application.",
    "Investigating LLMs for the verification of coding quality rules": "This project investigates utilizing Large Language Models (LLMs) like ChatGPT to automate the verification of coding quality rules in source code, particularly focusing on security standards such as the SEI CERT Oracle Coding Standard. The research will explore applying open-source LLMs to identify rule violations within Java or C++ code. Utilizing Python and static analysis tools (PMD, SonarQube), the project aims to develop a framework for automating checkers based on natural language rule specifications. Expected outcomes include improved software reliability through automated rule enforcement and potentially reducing bug introduction.",
    "Learning programming": "This project investigates how teacher approaches to programming instruction are shaped by student learning prerequisites. The research explores existing literature on influencing factors in student programming acquisition and adapting teaching methods accordingly. It examines teachers’ awareness of these diverse learner needs. No specific technologies are identified; the focus is on pedagogical understanding and adaptation within the field of informatics didactics. Expected outcomes include insights into tailoring instruction to student backgrounds for improved learning outcomes.",
    "LLM-enhanced computerized adaptive testing for programming education": "This project investigates the application of Large Language Models (LLMs) within Computerized Adaptive Testing (CAT) for programming education. Utilizing a question bank from web-cat.org, the system will dynamically adjust difficulty based on student responses via multiple-choice questions and LLM-generated explanations. The research aims to evaluate CAT’s effectiveness in introductory and advanced computer science courses (CS1 & CS2). Expected outcomes include a functional CAT system and insights into leveraging LLMs for personalized programming assessments.",
    "Learning analytics and AI learning systems in Norway": "This project investigates learning analytics (LA) and AI learning systems in Norway, analyzing existing data from national organizations like LCI Lab, Sikt, and NOKUT. The research aims to identify current LA/AI system usage, implementation practices, and associated challenges & opportunities within Norwegian education. Utilizing publicly available reports and potentially primary data collection (questionnaires), the project seeks to inform decision-making by clarifying policies and understanding the impact of these systems on educational practice. Expected outcomes include insights into LA adoption and potential improvements in learning environments.",
    "Learning software organisations": "This project investigates how software organizations foster organizational learning, particularly at team levels, within knowledge management practices. The research will begin with a literature review of organizational learning and knowledge management in software engineering. An empirical study is planned within a Norwegian software environment, potentially involving a case study identified through the supervisor’s network. Expected outcomes include insights into effective learning strategies and recommendations for improving organizational learning processes within the software industry.",
    "Let the LIMO floor robot solve interesting problems": "This project utilizes an AgileX LIMO floor robot equipped with stereo cameras, LiDAR, and a Jetson Nano GPU to develop foundational AI capabilities within the Robot Operating System (ROS). Research focuses on environment mapping, path planning, object recognition, and autonomous interaction tasks like treasure hunting or visitor greeting. Expected outcomes include student contributions to novel AI robotics challenges, potentially incorporating speech interaction, ultimately advancing robotic perception and control systems.",
    "Multiplayer game development using Web3 Technologies": "This project develops a multiplayer Blackjack game leveraging Web3 technologies like Solidity smart contracts, EVM-compatible blockchains, and web3 JavaScript libraries alongside traditional Spring Boot backend development. Research focuses on user identity & security within Web3, account abstraction, Play2Earn aspects, and cross-chain interoperability challenges. The expected outcome is a functional game demonstrating the integration of blockchain for asset management, automated payouts, and potentially exploring scalable decentralized gaming architectures.",
    "NBA Excitement Rater - Development of an data-driven pipeline to calculate the excitement of NBA games for Sportradar": "This project develops an “Excitement Score” pipeline for NBA games, aiming to enhance fan replay selection by predicting entertainment value. Utilizing real-time data and historical statistics, the project will identify key metrics like win probability and player performance to calculate a 1-100 excitement score. The development involves AI pipelines, system integration, and user experience design. Expected outcomes include a deployable pipeline for Sportradar’s internal teams and validated excitement scores through fan feedback testing. Sebastian will gain expertise in data analytics, machine learning within sports, and full project lifecycle management.",
    "Læringsteknologi": "This project investigates learning technology – software and related products supporting education and instruction. Research will explore self-directed tasks involving students or collaboration with faculty, potentially linked to the Excited Center for Excellence in Education. Technologies utilized are likely digital learning platforms and associated tools. Expected outcomes include developing innovative learning solutions and contributing to research within the field of educational technology.",
    "Machine learning-based prediction of revenue for actors providing Mobility-as-a-Service (MaaS)": "This project investigates predicting revenue for transport service providers within Mobility-as-a-Service (MaaS) ecosystems using machine learning. The research will develop a model leveraging data including travel patterns, demographics, weather, and parking information to forecast ticket sales. Collaboration with SINTEF Digital and utilizing open data sources are key components. Expected outcomes include a predictive tool aiding transport service providers in assessing MaaS participation opportunities and informing business decisions regarding profitability within the MaaSeKopp research project.",
    "Next-Gen Report Service Project Management Application": "This project develops a next-generation report service for a JavaScript project management application, replacing an outdated .NET/Crystal Reports system. Utilizing API-based JSON data extraction, it will generate multi-format reports (.docx, .pdf) with advanced graphical elements and 3D visualizations. Key features include large-scale data handling and automated delivery. The research focuses on streamlining reporting processes and enhancing data presentation for improved scalability and user experience. Expected outcomes are a more efficient, flexible, and future-proof solution aligned with modern technological standards.",
    "On the relation between software engineering and AI in Norway": "This master’s thesis investigates the intersection of software engineering and AI within Norway's development landscape using an empirical software engineering approach. The project will analyze data from TDT4290, conduct literature reviews and interviews with stakeholders, and examine software artifacts to identify trends and company relationships concerning AI-intensive systems. Expected outcomes include knowledge about current practices and potential research directions in this evolving field, informed by existing studies on software engineering trends and gender equality in AI.",
    "Open data - from vision to reality?": "This project investigates the realization of open data visions, specifically analyzing the Open Data Subsurface Universe platform (OSDU) within the fossil energy sector and its expansion into renewables. The research focuses on the social, practical, and institutional conditions needed for successful open data uptake beyond simple availability. Utilizing technologies like digital twins and data analytics, the project partners with Equinor and AkerBP to explore how OSDU can foster collaboration and innovation. Expected outcomes include insights into enabling factors for open data adoption and potential improvements within the platform’s framework.",
    "Omniverse, Content generation, Simulation and Digital Twins (2024)": "This project explores creating a real-time photorealistic digital twin of the Gløs campus using Omniverse and USD/Unity/UE, leveraging existing data for continuous updates. Research focuses on automating 3D content generation and integrating the model with simulators (DRIVE Sim, Isaac Sim, Carla) to train autonomous driving agents via imitation and reinforcement learning. The ultimate goal is to fine-tune AI models in simulation and apply them to a new AV platform for autonomous driving research, resulting in a scalable digital twin solution.",
    "Óne citizen - óne digital health twin (an ecosystem of smart digital twins - towards a data-driven health service) (2024)": "This master’s project explores developing a digital health twin ecosystem centered around wearable data (Garmin, smartwatches) to drive preventative healthcare. Utilizing existing MIA Health infrastructure, the focus is on transforming the platform from a “data-lake” into a predictive digital twin leveraging potentially LLMs for personalized insights and clinical study applications. Technologies include cloud platforms, frontend/backend development, and model integration. Expected outcomes involve creating a data-driven health service capable of predicting future health trends and facilitating more engaging patient involvement in research and care management, with strong emphasis on privacy and security considerations.",
    "Online Learning Platform – Enhancing Personalization with Self-Regulated Learning": "This project develops an online learning platform, Progresso, by integrating Self-Regulated Learning (SRL) principles to enhance personalization and student engagement. Utilizing React/Next.js for frontend development and Node.js with Prisma for backend, alongside Firebase database management, the research will implement a module supporting goal setting, progress monitoring, and adaptive strategies. A user study will evaluate the impact on learning efficiency, engagement, and retention. The expected outcome is an enhanced platform capable of fostering student autonomy and improved learning outcomes through data-driven insights and iterative system refinement.",
    "Organizational decision-making in the age of AI": "This project investigates the impact of artificial intelligence (AI) on organizational decision-making processes. Utilizing empirical methods, it examines how AI is transforming areas like banking, forecasting, and automation. The research will explore the effects and mechanisms associated with transitioning to AI-driven structures. Technologies involved include various AI applications within organizational workflows. Expected outcomes include a deeper understanding of AI’s influence on strategic choices and operational efficiency.",
    "Predictive Maintenance in Building Automation & HVAC Systems": "This project investigates predictive maintenance strategies for building automation and HVAC systems to optimize regular operations like air filter replacement. Utilizing a collaboration with Piscada’s industrial cloud platform (IoT), the research will identify and rank maintenance tasks based on economic impact, developing methods for reliable pre-emptive detection of needs. The expected outcome is a robust system offering insights and optimization for increased sustainability within selected industries, leveraging existing installations and aiming to establish Piscada as a leading industrial service platform.",
    "Open data and data platforms – how to succeed in practice?": "This project investigates successful implementation of open data initiatives, focusing on platforms like the Open Data Subsurface Universe (OSDU) within the oil & gas sector, expanding to renewable energy. Utilizing digital twin technology, it explores how open data – exemplified by projects like Covid vaccine development and PSD2 – drives productivity and market function. The research addresses challenges including motivation, technical infrastructure, and reward models through partnerships with Equinor and AkerBP. Expected outcomes include insights into practical strategies for realizing open data visions and fostering collaboration across industries.",
    "Open Foundation Models / LLM (type ChatGPT), fine-tuned and adapted to Health and integrated in a Digital Twin setting (2024)": "This project investigates the application of open foundation models (LLMs) like ChatGPT within a digital twin setting for healthcare personalization. Research will explore fine-tuning these models with limited data, integrating personal health data from wearables, and enabling natural verbal conversations. Key technologies include LLMs, digital twins, and potentially Med-PaLM 2. Expected outcomes involve developing explainable, privacy-conscious systems capable of generating empathetic responses and demonstrating superior performance compared to human physicians, as evidenced by recent AI model successes on medical exams.",
    "Predictive Maintenance in Fish Farming": "This project investigates predictive maintenance strategies for fish farming operations, collaborating with Piscada to develop reliable methods for detecting maintenance needs before equipment failure. The research will identify and prioritize critical maintenance tasks within Piscada’s industrial cloud-based software platform utilizing Industrial IoT technology. Expected outcomes include a system for proactive maintenance scheduling, enhancing operational efficiency and sustainability in aquaculture through optimized monitoring and insights.",
    "Qualitative study of Microsoft Copilot use by computing students": "This qualitative master’s project investigates computing students' use of Microsoft Copilot at NTNU. Utilizing observations, interviews, and archival data, the study aims to understand how students employ Copilot and its impact on their learning processes. The research will explore student practices through empirical qualitative methods. Expected outcomes include a rich understanding of Copilot usage within the computing field and contribute to knowledge regarding generative AI’s role in education.",
    "Ready for digital transformation - a game approach": "This project explores digital transformation’s impact on workplace competencies through game design. The aim is to develop a game that fosters systemic and critical thinking regarding new technologies and their implications. Students will collaborate with the supervisor to define specific areas of interest, including game genre and technology (e.g., prototyping tools). Expected outcomes include a playable game prototype and an evaluation of its effectiveness in promoting understanding of digital transformation challenges.",
    "RAY TRACING DATA STRUCTURES (with ARM)": "This project investigates ray tracing data structures, specifically BVHs, for real-time graphics applications utilizing ARM hardware. The student will implement either a Surface Area Heuristic (SAH) or Linear BVH algorithm in C++, potentially leveraging Vulkan Compute for GPU acceleration. The goal is to evaluate build time, memory footprint, and framerate impact on sample content. Utilizing resources like Vulkan and existing BVH implementations, the project aims to establish a robust test pipeline for future Masters thesis research into optimizing ray tracing algorithms and their performance across diverse hardware accelerators.",
    "Processing and analysing ice data": "This project investigates the utilization of Earth Observation (EO) satellite data in the Arctic and Baltic Sea regions for maritime applications, alongside opportunities within oil & gas and resource extraction, under an ESA-funded initiative. Research focuses on identifying data needs, assessing existing services, and analyzing current data usage patterns. Technologies involved include EO data processing and analysis. Expected outcomes encompass a comprehensive understanding of EO4BAS project findings and recommendations for optimizing satellite data application within these sectors, as documented in reports available at the provided portal.",
    "Ready for digital transformation - a co-design card based tool": "This project proposes a card-based co-design toolkit to support digital transformation within workplaces, addressing challenges stemming from insufficient worker understanding of new technologies. Inspired by the Tiles toolkit, it aims to foster creativity and system thinking while considering infrastructural constraints. The research focuses on empowering workers’ participation in digital transformation initiatives. Expected outcomes include a practical tool for visualizing technological possibilities and promoting collaborative problem-solving regarding technology implementation.",
    "Reflective and collaborative game for learning about AI": "This project explores designing reflective, collaborative games for learning about Artificial Intelligence (AI) tools across various contexts like schools and workplaces. The aim is to develop digital competencies related to understanding and influencing AI development. Students will collaborate with the supervisor to define target groups, learning objectives, game genres, and suitable technologies – prototyping and evaluation are key components of this research-focused task. Expected outcomes include a playable game prototype and insights into effective AI education strategies.",
    "Reliability evaluation of approximate computing techniques through fault injection": "This project investigates the reliability of approximate computing techniques through fault injection, focusing on compiler-level approaches. The research will compare different algorithms by deliberately introducing faults into existing benchmarks using C/C++ and Git. The goal is to assess how these techniques respond to errors and identify vulnerabilities within approximate computing systems. Expected outcomes include an extended benchmark incorporating fault tolerance perspectives and a comparative analysis of algorithm resilience, ultimately contributing to improved design strategies for resource-constrained applications.",
    "Reinforcement learning for multi-agent simulated autonomous driving": "This project investigates reinforcement learning for a multi-agent system controlling simulated autonomous vehicles in an urban environment using CARLA or Agilex.ai LIMO robots. The core technology is Reinforcement Learning applied to decentralized vehicle control. Expected outcomes include developing a self-learning scheme for steering simulated cars, potentially leading to improved autonomous driving strategies through agent collaboration and adaptation within the chosen simulation platform.",
    "Reinforcement learning for multi-agent simulated autonomous driving (H2024-V2025)": "This project investigates the use of reinforcement learning to develop a multi-agent system for autonomous driving in simulated urban environments. The research focuses on training simulated cars using RL algorithms to navigate complex scenarios. Key technologies include Reinforcement Learning and simulation software. Expected outcomes encompass a self-learning, adaptive control scheme for autonomous vehicle behavior within realistic traffic conditions, ultimately improving the efficiency and safety of simulated driving systems.",
    "Responsible AI in organizations": "This project investigates responsible AI adoption within organizations, examining its processes, structures, and organizational impacts. Research will explore how organizations define and achieve responsible AI indicators, assessing potential gains and influencing customer perceptions of technological innovation. The study anticipates analyzing organizational changes driven by responsible AI implementation, ultimately determining the benefits and limitations of this approach for both the organization and its stakeholders.",
    "Safety evaluation of trajectory planners in autonomous vehicle scenarios": "This project evaluates trajectory planners in autonomous vehicles from a safety perspective, integrating safety metrics into object detection algorithms. Utilizing machine learning for object detection, it will assess existing algorithms using datasets like nuScenes and simulators such as Carla. The research involves a literature review on safety metrics, applying them to various algorithms, and experimenting with parameters to define a benchmark for assessing autonomous vehicle safety. Expected outcomes include identifying robust trajectory planning strategies prioritizing safety and contributing to the development of standardized safety evaluation methods within autonomous driving systems.",
    "Samarbeide og kommunikasjon i helsesektoren": "This master’s project investigates collaborative challenges within Norway's healthcare sector due to siloed information systems hindering interprofessional communication and patient care coordination across different institutions. The project will explore a digital service implementation through empirical data collection via observation, interviews, and system logging. Utilizing IKT (digitalization) as a potential solution, the research aims to operationalize user needs into recommended or prototyped functionalities to improve healthcare workflows and ultimately enhance unified patient treatment.",
    "Shared Situational Awareness through Role-based Workspaces": "This project investigates shared situational awareness within industrial operations, specifically leveraging Active Knowledge Models (AKM) and the OSDU data platform for role-based workspaces. Utilizing IRTV concepts and Archimate integration, the research will extract and model data objects from the OSDU platform to enhance knowledge transfer across industries like energy. The expected outcomes include a set of functional use cases and a developed meta-model supporting standardized modelling within the OSDU ecosystem, in collaboration with Equinor.",
    "Robust obfuscation of Wasm": "This project investigates robust obfuscation techniques for WebAssembly (Wasm) code, addressing the challenge of balancing security research with performance overhead. The candidate will conduct a literature review and explore existing Wasm obfuscation methods, potentially utilizing LLVM-based tools like Binaryen. Expected outcomes include developing new security research tools, obfuscation frameworks, or proof-of-concept implementations focusing on instruction-level or intermediate representation obfuscation to enhance Wasm code protection.",
    "Semi-supervised learning for enhancing rare species birdsong recognition": "This project investigates semi-supervised learning techniques to improve birdsong recognition for rare species using the Sound of Norway dataset (7TB audio). The research, led by Björn Gambäck at NINA in collaboration with Benjamin Cretois, aims to enhance performance of existing deep learning models like BirdNET, which struggles with underrepresented species. Utilizing fine-tuning and few-shot learning, the project seeks improved model accuracy and recall for rare birds, contributing to more comprehensive biodiversity assessments. Technologies include deep learning, semi-supervised learning, and bioacoustic data analysis.",
    "Shipyard simulator for planning ship-breaking activities": "This project proposes developing a 3D shipyard simulator to optimize ship-breaking planning, addressing inefficiencies and safety concerns within the current 2D paper-based system. Utilizing user inputs for cutting plans and visualizing outcomes, the simulator will improve decision-making in this complex process involving hazardous materials. Key technologies include 3D modeling and simulation software. The project aligns with the SHEREC digitalization initiative, aiming to enhance safety through robot deployment and incorporating feedback from shipyard users. Expected outcomes include a functional simulator and insights into improved ship-breaking workflows.",
    "Smidig transformasjon": "This project investigates “smidig transformasjon,” examining challenges faced when implementing agile methodologies within larger organizations. The research will utilize a literature study across system development, information systems, and change management, potentially drawing upon data from the Agile 2.0 competence project (supported by SINTEF Digital). Key technologies involved include agile development practices. Expected outcomes include insights into organizational resistance to change and recommendations for successful agile transformations within complex environments.",
    "Smart Desks": "This master’s project, “Smart Desks,” investigates developing context-aware desks utilizing IoT technology and software solutions. Research involves analyzing existing literature, prototyping, and conducting user testing to optimize desk sharing and utilization. The project aims to create a system that transforms traditional workspaces into intelligent environments. Expected outcomes include a functional prototype and insights into user behavior regarding shared workspace design and implementation.",
    "Smart Urban Data Collection for Health and Well-being": "This project investigates urban health and well-being through data collection using a mobile phone and smartwatch system. The research employs both quantitative and qualitative methods to analyze individual perceptions within public spaces. Utilizing NTNU’s SWELL sustainability project, the study aims to understand user well-being by collecting and analyzing data on outdoor environments. Expected outcomes include design implications and a comprehensive understanding of urban health factors.",
    "Species prediction models applied to vulnerability detection in software": "This project investigates applying species prediction models to software vulnerability detection. It will analyze historical vulnerability data using statistical models, drawing parallels with species accumulation curves to predict vulnerability discovery rates and estimate total vulnerabilities within systems. The research considers factors like codebase size alongside software complexity. Expected outcomes include tools for software vendors and security researchers to better assess vulnerability risk based on historical trends and inform proactive bug hunting strategies.",
    "Sustainable migration of cloud infrastructure": "This master’s project investigates methods to mitigate vendor lock-in risks associated with cloud infrastructure migration, aiming for sustainable multi-cloud solutions. The research will review current state-of-the-art strategies to reduce dependency and enhance system robustness. Technologies explored include scalable cloud computing and software defined infrastructure. Expected outcomes involve practical solutions for transitioning to more flexible and cost-effective cloud environments, addressing concerns about proprietary technology limitations.",
    "System for vurdering av prosjekt og kode i en læringskontekst": "This project investigates developing a system for evaluating projects and code within an educational context. The focus includes automated testing, student peer reviews, and potentially integrating generative AI for feedback summarization and quality assurance. Technologies explored may encompass AI components and various assessment methods. Expected outcomes involve creating a robust system to facilitate comprehensive feedback and improve learning in programming and project-based courses.",
    "Supporting learning with cutting-edge XR technology: Apple Vision Pro, VR treadmill and haptic suit/gloves": "This project investigates the potential of advanced XR technologies – including Apple Vision Pro, VR treadmills (Cyberith), and haptic suits/gloves (BHaptics) – to transform university-level learning experiences. Utilizing the IMTEL VR lab’s extensive equipment, research will explore immersive simulations for subjects like architecture, anatomy, and interactive games with spatial computing and sensory feedback. Expected outcomes include innovative educational applications leveraging advanced XR capabilities, particularly in areas requiring physical movement and realistic tactile interaction.",
    "Sustainability by design": "This project investigates “Sustainability by Design” within software development, addressing how to integrate sustainability requirements into agile methodologies. Research will explore expressing, eliciting, and balancing these needs alongside traditional requirements. Utilizing existing and new techniques, the study will evaluate adherence to sustainability goals over short and long time periods, aligning with NTNU’s CESICT and the goforIT network. Expected outcomes include practical methods for incorporating sustainable practices into modern IT development workflows.",
    "System for tidlig deteksjon av dysleksi": "This project investigates early dyslexia detection by assessing visual processing impairments linked to slower-firing magnocellular neurons – a potential underlying cause of dyslexia and dyscalculia. The research involves developing and evaluating a system for testing visual information processing in children, aiming to identify signs of these neurological differences. Technologies utilized include methods for measuring visual processing speed. Expected outcomes are a refined, practical system for early dyslexia screening, collaborating with Hermundur Sigmundsson at the psychological institute.",
    "Teamwork in software development": "This project investigates teamwork within software development, particularly in agile environments. The research will conduct a literature review of existing team performance models and empirical studies focusing on agile and distributed teams. It explores factors impacting team effectiveness – a growing area of study given increasing reliance on small, self-organized teams. Expected outcomes include a comprehensive overview of current research and potential pathways for future empirical investigation into optimizing software development teamwork.",
    "The Strategic Value of Big Data Analytics": "This master’s project investigates the strategic value of big data analytics within Norwegian companies, in collaboration with the Big Data Observatory. The study will employ quantitative methods to examine how businesses utilize big data analytics for business value creation. Key technologies involve data analysis techniques and potentially visualization tools. Expected outcomes include a research-driven understanding of big data's impact on strategic decision-making and recommendations for capturing this value within the Norwegian context.",
    "The potential of Artificial Intelligence for public administration": "This project investigates the growing application of Artificial Intelligence (AI) within public administration, exploring its current status, potential uses like fraud detection and infrastructure monitoring, and realized value. Conducted in collaboration with SINTEF Digital, it involves data collection, analysis, and reporting to assess AI adoption trends. The research aims to identify promising areas for AI implementation within public organizations and ultimately determine the benefits of utilizing this technology.",
    "Tag inference": "This project investigates tag inference using time series data from building automation systems to classify equipment based on emitted sensor readings. The student will explore preprocessing methods, model types (potentially clustering), and evaluate class structure within a dataset of anonymized high-frequency data from hundreds of buildings. Utilizing Piscada’s industrial cloud platform, the research aims to develop a predictive model for equipment identification, contributing to improved monitoring, insights, and optimization across construction, energy, aquaculture, and process management industries.",
    "Toolkit for Technologically Rich Education": "This project develops a digital toolkit for K-12 Design Thinking activities, focusing on collaborative problem-solving with technology. The toolkit will guide students through ideation, prototyping, and testing phases while collecting data on their creative processes. Utilizing JavaScript, HTML, and CSS, the research involves literature review, iterative platform design, user testing, and data analysis to assess toolkit efficacy. Expected outcomes include a refined, user-centered tool supporting student learning and peer collaboration within technologically rich Design Thinking environments.",
    "Transforming IT operations: organisational perspectives": "This project investigates organizational approaches to adopting DevOps practices within IT operations. The research focuses on how traditional software development and operations teams can be reorganized into multidisciplinary DevOps models, leveraging automation to enable rapid deployments and improve software quality. Key technologies include DevOps methodologies and automated deployment processes. Expected outcomes involve understanding the challenges and strategies organizations employ to successfully transition from rigid, siloed IT operations to a more agile, integrated DevOps framework, ultimately streamlining application lifecycle management.",
    "Unsupervised learning for automatically annotating eye tracking data": "This project investigates automating eye movement annotation using unsupervised learning techniques applied to existing, open datasets. Utilizing infrared eye tracking data with potential for VR applications, the research aims to improve annotation accuracy by exploring data augmentation and addressing inaccuracies stemming from hardware limitations. The core focus is on comparing automatic annotations against established human-annotated datasets. Expected outcomes include a validated methodology for efficient, automated eye movement categorization and insights into applying these techniques within dynamic environments like virtual reality.",
    "Understanding an organisation's adaptive capacity to handle IT incidents": "This project investigates an organization’s adaptive capacity to manage IT incidents amidst increasing cyber threats and complex IT/OT convergence. Utilizing a resilience engineering perspective, it examines collaborative practices within incident management of internet-facing software systems. The research will explore how organizations respond to disruptions, considering factors like human performance and cybersecurity vulnerabilities. Expected outcomes include identifying key strategies for enhancing organizational robustness and improving incident response effectiveness through a socio-technical lens.",
    "Understanding the execution behavior of high-level productivity languages": "This project investigates the execution behavior of high-level productivity languages (Python, NodeJS) compared to compiled languages (C, C++) within processor architectures. The research aims to develop a tool for precisely tracking application data and code within caches – specifically front-end instruction/data caches versus back-end data caches. Utilizing performance analysis, the project seeks to understand how these applications impact processor components like branch predictors and data caches, ultimately proposing methods for improved execution efficiency and energy-efficiency in high-level language applications.",
    "Unlocking Insights from Video Content – A Large Language Model Approach": "This project investigates automated transcript extraction from YouTube videos using large language models (LLMs) to analyze spoken content trends. The system will retrieve transcripts via API, process them with LLMs for categorization, summarization, and visualization, and provide a user-friendly interface. Key technologies include Python, API integration, and NLP techniques. Expected outcomes encompass an automated transcript retrieval system, LLM-driven data analysis pipelines, interactive trend exploration tools, and a user study evaluating the system’s effectiveness and usability.",
    "Verification of coding conventions for Java using CodeQL": "This project investigates using GitHub CodeQL to verify coding conventions for Java, specifically focusing on the SEI Cert Oracle Coding Standard’s security rules. The research will involve writing CodeQL queries, comparing results with existing static analysis tools like PMD and SonarQube, and assessing the feasibility of specifying all rules within CodeQL.  The project aims to improve code quality rule verification techniques. Key technologies include Java, CodeQL, and Git. Expected outcomes include a comparative analysis of CodeQL’s capabilities versus traditional static analysis tools and insights into effective query design for coding standard enforcement.",
    "VIRTUAL DEVICES": "This project explores the creation of virtual camera and microphone devices within Windows using Python and C/C++. The research focuses on developing applications like voice modification and facial characteristic alteration for digital meetings. Inspired by existing solutions (OBS Virtual Camera, VB Cable), the project aims to demonstrate innovative visual and audio effects. Expected outcomes include functional virtual device implementations and associated application prototypes, leveraging knowledge gained from courses such as Visual Computing Fundamentals and Graphics & Visualization.",
    "Use of honeypots for understanding attacker methodologies in n-day vulnerable software": "This MSc project investigates the use of honeypots to understand attacker methodologies targeting n-day vulnerable software. The research will explore deploying realistic honeypots simulating CVEs to detect and mitigate cyber threats, differentiating between automated and manual attacks. Key areas include honeypot realism, deployment strategies, and their potential as threat intelligence sources. Expected outcomes involve identifying practical considerations for honeypot implementation and contributing to enhanced cybersecurity defense strategies through detailed analysis of attacker behavior.",
    "Using LLMs and conversational agents to support children’s science learning": "This project investigates using LLMs and conversational agents (e.g., CodeLLama, ParlAI) within a mobile application to enhance children’s science learning at science centers. The research will explore integrating multimodal LLMs with interactive elements like gamification and analytics through user studies in school or museum settings. Utilizing technologies such as JavaScript, CSS, and MySQL, the project aims to develop an engaging app that allows children to interact with scientific concepts via questions and exploration. Expected outcomes include a functional mobile application prototype and empirical data on its effectiveness in fostering children’s interest in science.",
    "Visual Intelligence and accurate geo-referencing of road objects on mobile devices (2024)": "This project aims to develop a mobile app utilizing AI for accurate geo-referencing of road objects via camera and u-blox positioning with CPos corrections (cm accuracy). The research focuses on assessing and classifying road object conditions using AI models. Expected outcomes include creating HD maps, real-time image matching, and data collection for neural rendering applications. Collaboration involves national authorities, SINTEF, and regional municipalities, leveraging innovation in visual intelligence and precise geo-location technology.",
    "Visualisering av kriterier for nullutslippsområder": "This project investigates criteria for zero-emission areas within smart cities, aligning with the FME ZEN research center’s goals of realizing a carbon-neutral society. The work will develop data dashboards and an underlying data architecture to visualize relevant environmental data for urban planning. Utilizing a design science research methodology, it focuses on efficient energy use and renewable energy production. Expected outcomes include a publishable scientific publication and tools for monitoring and achieving national climate targets through effective data visualization.",
    "Workplace training in Virtual Reality in collaboration with NAV and VR4VET Erasmus + project": "This master’s project investigates using Virtual Reality (VR) training to enhance motivation and skill acquisition for young job seekers in collaboration with the Erasmus+ VR4VET project. Utilizing technologies like Apple Vision Pro, HTC Vive, and BHaptics suits, students will simulate workplace environments – such as aquaculture or shipyards – allowing immersive task practice. The project aims to develop innovative vocational training methods, informed by NAV and industry partners across Europe (TU Delft, TH Köln). Expected outcomes include prototype development and a new approach to engaging career guidance through active VR exploration, building upon previous award-winning Virtual Internship prototypes.",
    "Visual Simultaneous Localization and Mapping (VSLAM) for an Underwater Snake Robot (H2024-V2025)": "This project investigates Visual Simultaneous Localization and Mapping (VSLAM) for an underwater snake robot, addressing challenges like turbid water and moving illumination. Utilizing AROS with real video footage and a simulation environment, the student will explore novel approaches in geometric modeling, statistical estimation, and machine learning – including keypoint tracking, dynamic prediction, and optimization techniques. The project aims to develop a robust VSLAM system tailored for underwater environments, potentially integrating IMU data and employing deep learning for depth/flow estimation. Expected outcomes include experimentation with advanced algorithms and contributing to the design of a functional underwater navigation system.",
    "What is the Business Value of Artificial Intelligence?": "This master’s project investigates the business value of artificial intelligence for private and public organizations. The research will assess organizational readiness for AI adoption and analyze derived investment value through data collection with the Big Data Observatory. Key technologies explored include AI applications within organizations. Expected outcomes involve understanding strategic planning, identifying necessary steps for AI implementation, and ultimately quantifying the return on investment in AI technologies.",
    "What are the skills of the future: A look at how Artificial Intelligence and Analytics change the competences of computer science graduates": "This project investigates how Artificial Intelligence and Analytics are reshaping the skill requirements for computer science graduates. Utilizing data collected through focus groups and surveys in collaboration with the Big Data Observatory, the research will identify crucial skills needed by organizations. Key technologies explored include big data analytics and artificial intelligence. The anticipated outcome is a detailed analysis of necessary skills and recommendations for educational institutions to adapt their curricula and produce graduates aligned with future industry demands.",
    "XR4Edu - XR in Education": "This project, XR4Edu, explores utilizing Extended Reality (XR) – VR/AR – to revolutionize education. Research focuses on immersive learning experiences for computer graphics, algorithms, and medical applications like echocardiography and fetal ultrasound. The project will investigate merging existing tools into collaborative AR/VR environments and augmenting 3D models with virtual elements. Expected outcomes include developing innovative teaching tools and enhancing student engagement through realistic simulations, ultimately improving understanding of complex concepts in both computer science and medicine.",
    "XR4Med - Augmented reality tools for intra-operative applications (St. Olav, SINTEF)": "XR4Med aims to enhance intra-operative procedures using augmented reality (AR) mixed reality tools. The project develops a visualization framework integrating data from cardiac ultrasound and bronchoscopy, leveraging an open-source platform. By presenting combined image and anatomical model information within the operator’s field of view, the research seeks to improve ergonomics and increase procedure success rates. Technologies include XR development and existing imaging platforms. Expected outcomes involve a refined visualization system for improved surgical workflows.",
    "XR4CE - Citizen Engagement with XR": "This project, “XR4CE – Citizen Engagement with XR,” investigates utilizing Extended Reality (XR) technologies to enhance e-governance by facilitating efficient citizen engagement and feedback capture. The research aims to develop tools for knowledge transfer and communication, addressing subjective biases impacting citizen input. Key technologies include XR applications. Expected outcomes involve a conceptual framework and practical tools for optimizing citizen participation in policy strategies through immersive experiences.",
    "XR4Colab - Remote Learning and Collaboration with Augmented Reality and Hololens 2": "This master project, XR4Colab, investigates AR-supported collaborative learning using Hololens 2 units in a remote setting. Research will focus on design principles for interactive AR experiences, informed by applications in industries like energy (Equinor) and healthcare. The project leverages Augmented Reality technology to enhance distributed learning and collaboration. Expected outcomes include insights into effective AR tools and potentially a pilot implementation with a partner organization or educational institution, collaborating with the IMTEL lab under Gabriel Kiss’s supervision.",
    "Zero Emission Farm – digital game design and development": "This project develops a digital game, “Zero Emission Farm,” to educate players about reducing carbon emissions in agriculture within the FME-ZEN project. Utilizing iterative design and development, the game will leverage domain knowledge from the existing Climate Calculator. Technologies include game design and development tools. Expected outcomes include raising awareness of zero emission farming practices and enhancing player understanding of greenhouse gas reduction strategies through collaboration with Mære Agricultural School.",
    "[NorwAI] Neural Machine Translation in Written Norwegian - Bokmål and Nynorsk - with Generative Pre-trained Transformer": "This master’s thesis investigates the feasibility of using Generative Pre-trained Transformer (GPT) models for Neural Machine Translation (NMT) between Bokmål and Nynorsk, two low-resource Norwegian variants. Utilizing a 28.6MB parallel corpus from the National Library of Norway and a 318.6M parameter GPT model provided by NorwAI, the project aims to develop an efficient GPT-based NMT system. The research will involve a literature review, approach design, and evaluation focusing on challenges like named entity recognition and long text translation. Expected outcomes include a functional GPT-NMT model demonstrating potential for translating Bokmål and Nynorsk, addressing current limitations in existing NMT approaches due to",
    "An immune system approach to fake News Classification": "This project investigates fake news classification using an immune system model, drawing parallels with antibody-antigen interactions. The research aims to extend and refine this novel approach, allowing for student choice in specific development paths. Technologies utilized will likely involve machine learning algorithms and potentially immunological data analysis. Expected outcomes include a refined immune system framework for improved fake news detection and a deeper understanding of applying biological concepts to information classification challenges.",
    "Åpne data og dataplattformer – fangstregistrering": "This project investigates the use of open data and technology platforms to improve catch recording in the Norwegian fishing industry, aligning with national digitalization strategies. Utilizing technologies like sensors, AI (including image recognition), and open data initiatives, the research aims to combat fisheries crime, promote fair competition, and support sustainable fishing practices. Collaboration between SINTEF Nord, Norges Fiskerihøgskole, and the Fisheries Directorate will focus on leveraging these tools for accurate catch registration, ultimately contributing to a more efficient and transparent fisheries sector.",
    "AI for eyesight": "This master’s project explores utilizing artificial intelligence for eye sight diagnostics and spectacle solutions in collaboration with an international startup. The research focuses on computer vision applications within industrial settings, potentially impacting global health initiatives, particularly in developing countries. Technologies utilized will likely include AI algorithms and related software. Expected outcomes involve innovative diagnostic tools and improved spectacles addressing eyesight issues.",
    "[NorwAI] Sentiment Analysis Based on Brain Signal Feedback": "This project investigates sentiment analysis using brain signal feedback from functional imaging (fMRI). The research aims to develop a mapping function between fMRI signals and sentiment load of words within sentences. Utilizing machine learning techniques with annotated text and MRI data, the system will cluster signal characteristics corresponding to positive, negative, or neutral sentiments. Expected outcomes include a scalable, accurate system for continuous sentiment estimation based on MRI data, suitable for applications like healthcare and social media analysis. Technologies involve fMRI, machine learning, and natural language processing.",
    "Bio-inspired techniques applied to remote sensing with hyperspectral data": "This project investigates bio-inspired techniques, specifically Particle Swarm Optimization and superpixel analysis, for unsupervised spectral band selection within hyperspectral remote sensing data. Utilizing NSGA-II from a previous study, the research aims to improve dimensionality reduction of high-dimensional data related to vegetation, agriculture, and disaster monitoring. The expected outcome is enhanced classification accuracy and efficiency through optimized spectral band selection, building upon prior work in clustering and evolutionary algorithms.",
    "Customized Query Execution Plans in Graph Databases": "This project investigates customized query execution plans for property graph databases like Neo4j and Kùzu, addressing a gap in existing solutions. It aims to design and develop a system enabling the injection of cardinalities and/or custom query plans, mirroring approaches used in relational databases via PgCuckoo. The research leverages knowledge of database internals and property graph concepts. Expected outcomes include a functional solution for optimizing queries within these graph databases, potentially improving performance and efficiency through tailored execution strategies.",
    "An Immune System Approach to Music recommendation": "This project investigates using immune system algorithms, specifically AIRS, for music recommendation systems. It explores applying these approaches to Automatic Playlist Continuation (APC) through content-based filtering, potentially expanding to incorporate collaboration-based methods. The research aims to develop tailored music recommendations within a data-rich environment. Expected outcomes include improved playlist generation and a deeper understanding of utilizing immune system techniques in recommendation algorithms.",
    "Analysing the Effectiveness of Last Level (Data) Cache for Cloud Applications": "This project investigates the effectiveness of last-level (LLC) caches in cloud applications, addressing concerns about wasted energy, area, and cycles within modern processor designs. Utilizing simulations of typical cloud workloads with varying cache configurations and eviction policies, the research aims to identify performance bottlenecks and propose solutions. The study leverages system architecture understanding and hardware simulators to analyze data access patterns and optimize resource utilization. Expected outcomes include insights into reducing overhead associated with LLC lookups and informing next-generation processor design for improved cloud application performance.",
    "Database opportunities at Huawei Research lab, Trondheim (updated, 1. June 2022)": "This project investigates opportunities within Huawei’s Trondheim database research lab focusing on Hybrid Transactional and Analytic Processing (HTAP) in cloud-native systems like AWS Aurora and Oracle Autonomous Database. Research topics include optimizing query processing with metadata & statistics, leveraging machine learning in databases, managing semi-structured data in OLAP systems, and utilizing external data statistics. The project explores caching techniques and information lifecycle management for HTAP systems involving diverse storage services. Expected outcomes involve evaluating novel approaches to accelerate analytic queries and improve database performance within cloud environments.",
    "Event Mining and Linking": "This project investigates event mining and linking from large news archives to create coherent storylines for improved user comprehension. Utilizing data mining, databases, information retrieval, and natural language processing techniques, the research aims to extract events like tournament qualifications and link them with relevant contextual information. The expected outcome is a system capable of weaving together complex narratives from news data, facilitating better understanding of specialized topics.",
    "Exploration of GraphRAG-extracted Knowledge Graphs": "This project investigates the value of knowledge graphs extracted by GraphRAG for improved Q&A performance and reasoning. The research evaluates the quality of these knowledge graphs beyond initial applications, aiming to enhance understanding of GraphRAG’s capabilities. A tool will be developed for efficient graph exploration utilizing a graph database (optional). Technologies include GraphRAG, Java/Python, and UI frameworks. Expected outcomes are a deeper understanding of knowledge graph extraction within RAG systems and a practical tool for exploring these graphs, ultimately improving downstream task performance.",
    "Evaluation of Streaming Graph Processing Frameworks": "This project evaluates existing streaming graph processing frameworks to address the growing need for efficient handling of dynamic graph workloads in domains like machine learning and social network analysis. The research will involve designing a prototype pipeline for analytics over real-world streaming graphs. Key technologies include graph databases and data analytics tools. Expected outcomes are a comparative assessment of current frameworks and a functional prototype demonstrating efficient streaming graph processing, contributing to bridging the gap in research and industry knowledge within this area.",
    "Exciting topics in HPC & Parallel Computing": "This project explores exciting topics within High-Performance Computing (HPC) including Parallel Computing, Quantum Computing simulations, and Cloud Technologies. Research will focus on developing new parallel algorithms, testing NVIDIA B100s, and investigating GPU features. The project may also involve creating edutainment for teaching parallel programming. Expected outcomes include novel algorithmic solutions and a deeper understanding of HPC technologies, potentially leading to improved performance and educational resources.",
    "Evolving personalised training programs to reduce/relieve Metabolic Syndrome": "This project investigates personalized training programs to combat metabolic syndrome, a growing health concern linked to sedentary lifestyles and processed food access. Utilizing a Genetic Algorithm, the research will generate dynamic, evolving exercise regimens tailored to individual patient health status. The goal is to proactively reduce the risk of cardiovascular disease and type 2 diabetes by adapting training programs over time. Key technologies include genetic algorithms and continuous monitoring of patient health data. Expected outcomes involve developing effective, personalized interventions for metabolic syndrome management.",
    "Human Pose Estimation for VR-exergaming": "This project investigates the use of Human Pose Estimation (HPE) within VR-exergaming for rehabilitation, addressing limitations of traditional motion tracking methods. Utilizing Unity and a multi-ocular HPE model, the thesis will develop a prototype VR-exergame with real-time feedback based on participant performance. Comparative testing of pose estimation frameworks will optimize game control and provide targeted guidance. The expected outcome is a usable system demonstrating HPE’s potential to enhance motivation and accessibility in rehabilitation exergaming, ultimately reducing reliance on clinical supervision.",
    "Hybrid Vector Search in High-Dimensional Space": "This project investigates hybrid vector search for high-dimensional data, focusing on efficient approximate k-nearest neighbor retrieval with non-vector attributes. Utilizing code from the 2024 SIGMOD Programming Contest, the research aims to improve indexing approaches under time constraints – balancing index build cost and query execution speed. Technologies include vector similarity measures (e.g., Euclidean distance) and potentially novel indexing techniques. Expected outcomes involve exploring optimized indexes and extending these ideas to diverse attribute types and query scenarios.",
    "Extending hybrid vector search (multiple projects)": "This project explores extensions to hybrid vector search, focusing on algorithmic improvements for approximate nearest neighbor search using pre-trained embeddings. Research will investigate combining vector search with database operations, streaming approaches, and GPU-enhanced algorithms/indexes. Students will develop, implement, and evaluate solutions on a large dataset in C++. Relevant technologies include vector databases and existing ANN implementations (C++). Expected outcomes are novel indexing techniques and optimized hybrid search strategies for efficient similarity queries within multi-modal data.",
    "Further development of a novel immune-inspired hybrid classification algorithm": "This project will expand upon the MAIM hybrid classification algorithm, inspired by the immune system’s anomaly detection capabilities. Utilizing an Island Model Genetic Algorithm (IGA), the research aims to further refine and extend this novel approach. Technologies employed include genetic algorithms and potentially new optimization techniques. Expected outcomes involve improved classification performance and a deeper understanding of applying biological principles to algorithmic design, building upon previous promising results and an international publication.",
    "Industry (and AI-lab pitched) project proposals related to Visual intelligence (AI/CV) (2024)": "This project explores visual intelligence (AI/CV) applications across diverse industries including healthcare, sports analytics, materials science, autonomous driving, and drone inspection. Research areas encompass video analysis, image segmentation, deep learning, and AI-assisted labeling of data from CT scans and LiDAR systems. Expected outcomes include developing HD-maps for automated vehicles, analyzing fouling on test panels, characterizing aluminum alloys, and identifying/classifying objects using computer vision. The project leverages technologies like AI, CV, LiDAR, and potentially drone platforms, aiming to provide actionable insights through digital twins and improved data analysis.",
    "Merging of offline databases": "This project investigates merging offline databases, addressing synchronization needs for disconnected teams like rescue services. Research will explore solutions utilizing techniques such as Conflict-free Replicated Data Types (CRDTs), mergeable data structures, and operational transformations. The aim is to develop robust methods for synchronizing data from previously isolated databases, ultimately improving data consistency and workflow efficiency in challenging environments.",
    "Learned index and updates": "This project investigates efficient update handling within learned index structures, addressing challenges posed by high insert/update loads. Research will survey current update methodologies and propose improvements. The project explores multi-dimensional indexes (including R-trees) and specifically tackles the complexities of string indexing – a known research difficulty. Expected outcomes include optimized update strategies and potential advancements in learned index technology.",
    "Learning Indexing Patterns from Annotated Document Collections": "This project investigates indexing patterns within annotated document collections using natural language processing tools like Stanford CoreNLP. The research focuses on leveraging semantic annotations (entities, time periods, numerical ranges) present in query logs to improve information retrieval. Key technologies include databases and data mining techniques. Expected outcomes involve developing methods for efficient querying of documents based on specific temporal and entity criteria, ultimately enhancing document relevance and access within large collections.",
    "Locality of Access in Graph Databases": "This project investigates locality of access in graph databases to minimize cache misses during query processing. The research focuses on implementing and evaluating graph ordering schemes, potentially utilizing existing systems like Kùzu, for both main memory and disk-level operations. Technologies include C/C++ programming and existing graph database systems. Expected outcomes involve a benchmark to assess the efficacy of different ordering strategies in real-world graph queries – particularly path and star queries – ultimately improving query performance and reducing data access latency within graph databases.",
    "Managing big data volumes": "This project investigates methods for efficiently parallel data insertion into databases like B-trees and R-trees, particularly focusing on large datasets such as satellite geographic data or GPS trajectories. Research will explore techniques for handling sequential data like logs alongside spatial data. The anticipated outcome is a better understanding of scalable parallel database solutions for managing big data volumes, potentially optimizing performance in applications involving high-volume data insertion.",
    "NoSQL/NewSQL (scalable)  databases": "This master's project explores scalable database solutions using both NoSQL and NewSQL databases. Research areas include transational models in NewSQL, multi-dimensional indexing in NoSQL, and automated scaling/upgrading of NoSQL systems. The project allows for student-driven selection of a preferred database (e.g., exploring specific features or optimization techniques). Expected outcomes involve developing and implementing innovative database solutions with enhanced scalability and performance.",
    "Numerical Contours": "This project investigates constructing a scalable annotator for temporal and numerical expressions within large document collections like Wikipedia. Utilizing databases, information retrieval, and natural language processing, the research focuses on annotating numerical quantities with associated units and enabling easy conversions. The goal is to address questions regarding entity-linked numerical annotation and scalability, ultimately producing a system capable of processing extensive text data and extracting quantitative information effectively.",
    "Merging of spatial data": "This project investigates merging spatial data using techniques similar to LSM-trees, addressing the challenges of high insertion rates within big geospatial datasets. The research focuses on integrating data represented with space-filling curves like R-trees. Key technologies involve LSM trees and spatial indexing methods. Expected outcomes include developing efficient methods for merging geodata, optimizing data retrieval speeds, and contributing to scalable geospatial data management solutions.",
    "MySQL related projects 2025": "This master’s project explores implementation and evaluation opportunities within MySQL, collaborating with Oracle Trondheim. The project leverages TDT4150 prerequisites alongside strong programming skills and algorithmic interest. Research will likely involve utilizing MySQL as its core technology. Expected outcomes include practical implementations and evaluations related to the database system, contributing to ongoing development efforts within the MySQL Engineering team at Oracle.",
    "Open-ended evolution": "This project investigates open-ended evolution through a hybrid algorithm combining the Paired Open-Ended Trailblazer (POET) and Neuroevolution of Augmented Technologies (NEAT). The research explores whether POET’s minimal criterion and transfer mechanisms are essential for generating complex solutions in challenging environments, specifically maze navigation with adversaries. Utilizing coevolutionary algorithms, the project aims to replicate nature's creative evolution by continuously producing increasingly difficult problems and their solutions. Expected outcomes include insights into algorithm design and potential extensions for further exploration of open-ended evolutionary approaches.",
    "Recognizing meta-data on car tires": "This project aims to automate tire maintenance through computer vision. Utilizing a dataset of tire images and manually collected metadata, the candidate will develop models for predicting tire size, manufacturer, and profile depth, as well as damage detection. The research focuses on applying computer vision technology to streamline data collection in tire maintenance operations. Expected outcomes include automated meta-data recognition and improved damage assessment efficiency.",
    "Similarity of trajectories": "This project investigates algorithms for identifying similarity within trajectories, with applications in areas like ride sharing and route analysis. Research focuses on creating a useful index, potentially utilizing Locality Sensitive Hashing (LSH) techniques – previously optimized by student projects – to efficiently pre-filter data before employing methods such as Dynamic Time Warping. The expected outcome is a refined approach for trajectory similarity assessment, leveraging optimized parameters for diverse datasets.",
    "Particle Swarm Optimisation as a modelling tool for Climate Change": "This project investigates using Particle Swarm Optimization (PSO) to model human behavior related to climate change mitigation. The research aims to develop a PSO modelling environment exploring individual contributions towards collective benefit. Utilizing PSO, the study will examine how incentives can influence individuals’ willingness to sacrifice for future populations. Expected outcomes include a functional modeling tool and insights into behavioral drivers within climate action strategies.",
    "Scaling algorithms for databases": "This project investigates the practical application of hashing algorithms for scaling databases, building upon Marit Lindstad’s theoretical master's work. The research will focus on evaluating various hashing algorithms within scalable, distributed database environments. Technologies likely involve database systems and potentially NoSQL solutions. Expected outcomes include identifying optimal hashing strategies for improved database scalability and performance, contributing to practical advancements in data scaling techniques.",
    "Semantic Text Indexing": "This project investigates semantic text indexing using deep learning techniques like word2vec to improve search relevance for underspecified queries. The research focuses on scaling semantic matching across large document collections, addressing limitations of black-box deep learning models. Utilizing databases and information retrieval principles, the goal is to develop alternative methods for endowing text with semantics and achieve scalable semantic text matching. Expected outcomes include a novel approach to enhancing search accuracy and understanding of complex queries.",
    "[2023/2024 Collaboration with Refinitiv AS] - Deep Learning Models for detecting wind turbines’ curtailment": "This project investigates using deep learning models to predict wind turbine curtailment for Refinitiv AS. The research focuses on leveraging weather conditions, system operator forecasts, and price data as inputs. Utilizing advanced algorithms, the goal is to anticipate curtailment events proactively. Expected outcomes include improved wind power forecasts and enhanced decision-making capabilities for system operators and traders regarding grid stability and resource allocation. Technologies employed will center around deep learning techniques within a forecasting context.",
    "[2023/2024] Exploring the Effectiveness of Synthetic Data Generation in the Air Traffic Management Domain": "This master’s thesis investigates the effectiveness of synthetic data generation techniques – including GANs, VAEs, and diffusion models – for Air Traffic Management (ATM). The project, part of the SynthAIr European initiative, aims to improve ATM automation by generating high-quality synthetic data for use cases like turnaround and flight delay prediction. Research will address challenges related to mixed data types and complex dependencies. Expected outcomes include insights into optimizing data generation methods and their impact on machine learning model performance, ultimately contributing to increased efficiency, robustness, and resilience in AI-driven ATM systems.",
    "The effect of scale on the performance of 3D shape matching algorithms": "This project investigates the impact of scale on the performance of 3D shape matching algorithms, crucial for applications like autonomous robot navigation. The research aims to develop an algorithm that automatically estimates the optimal scale parameter for comparing similar surfaces, addressing the current reliance on manual setting. Utilizing existing 3D surface comparison techniques, the expected outcome is a robust method ensuring consistent scale estimation across altered surfaces and improving recognition accuracy.",
    "Text Driven Analytics and Visualization": "This project explores text-driven analytics and visualization using a scalable information extraction infrastructure to analyze large volumes of textual data from the web. The research focuses on databases, information retrieval, and data mining. The system will generate visualizations and enable users to perform text-based analysis. Expected outcomes include a functional system for extracting insights and creating interactive visualizations from unstructured text data.",
    "[Collaboration with Maritime Robotics] Efficient Vision Transformers for Real-Time Object Segmentation and Deployment on NVIDIA AGX Orin": "Efficient Vision Transformers for real-time object segmentation deployment on NVIDIA AGX Orin. This project investigates transformer-specific optimisation techniques (sparse attention, token pruning, mixed-precision) to reduce computational costs and memory usage of ViT models compared to CNNs like RTMDet. The research aims to improve latency, power efficiency, and accuracy for maritime robotics applications within the SeaSight pipeline. Utilizing PyTorch, TensorRT, CUDA, and NVIDIA Orin hardware, the project will benchmark optimised ViT models against a baseline implementation, ultimately delivering a framework for real-time situational awareness with reduced computational cost.",
    "AI-based computer vision for salmon identification / alternatively: AI-based perception for autonomous ships": "This pre-project explores AI-based computer vision for either salmon identification/tracking or developing a perception system for autonomous ships. The work will involve literature review, technical background exploration, and establishing a detailed research plan. Key technologies include artificial intelligence and computer vision. Expected outcomes are a defined research direction and a comprehensive project plan leading to an MSc thesis in either salmon identification or autonomous ship perception.",
    "[Collaboration with Maritime Robotics] Optimising RTMDet / RTMDet-Ins on NVIDIA AGX Orin": "This project optimizes RTMDet for real-time object detection on the NVIDIA AGX Orin platform within the SeaSight pipeline. Research focuses on addressing memory bandwidth and power constraints through techniques like model quantization, pruning, GPU-DLA offloading, and efficient memory access patterns. Utilizing PyTorch, TensorRT, CUDA, and profiling tools (Nsight Systems), the project aims to achieve minimal computational overhead while maintaining accuracy. Expected outcomes include an optimized RTMDet implementation for real-time inference, a tailored optimization framework, and integration into the SeaSight system enhancing situational awareness for USVs.",
    "3d-to-2d Face Recognition using Machine Learning": "This project investigates 3D-to-2D face recognition using a combined approach of classical deep learning networks and geometric deep learning. The research will utilize synthetic data generated by FaceGen to train Siamese Networks, leveraging Python and potentially C/C++.  The goal is to extract features from both 2D facial images and 3D facial models for improved recognition accuracy. Expected outcomes include a novel 3D-2D FR system demonstrating enhanced performance compared to existing methods, utilizing technologies like deep learning branch networks and loss functions.",
    "AD - AI-agents trained end-to-end by Imitation and Reinforcement learning in simulated environments (2024)": "This project investigates end-to-end AI agent training using deep reinforcement learning within simulated environments like CARLA, NVIDIA Omniverse (Isaac Sim), and MARS. The research leverages state-of-the-art approaches including UniAD, Paper, CodeMILE, and trajectory-guided control prediction methods. A realistic virtual replica of the Gløs area will be created for local agent training. Expected outcomes include trained AI agents capable of autonomous navigation and performance improvements through imitation and reinforcement learning techniques.",
    "[NorwAI] Automatic Reading of Traffic Announcements": "This project aims to develop an automatic system for reading traffic announcements in Sweden using speech recognition and text-to-speech technology. The system will utilize data from NRK.Risk to synthesize audio messages broadcast through channels like “traffic announce” or VMA.  The research focuses on accurate and timely delivery of critical information to drivers and passengers, improving road safety and transportation management. Expected outcomes include a reliable automatic reading system that reduces driver distraction and enhances accessibility of traffic updates.",
    "Aneo: Predictive maintenance of cooling systems in retail stores": "This master’s thesis at Aneo, a renewable energy company, focuses on predictive maintenance of cooling systems in retail stores using AI. The project will analyze historical data (fault events, temperature, pressure, energy consumption – CSV format) to build models predicting future faults and downtime. Key technologies include data analysis and machine learning model development. Expected outcomes include optimized maintenance scheduling, reduced service costs, and proactive fault detection, ultimately improving energy efficiency within Aneo’s retail operations.",
    "Anomaly detection in x-rays": "This project investigates anomaly detection in chest X-rays using the VinDR dataset, which contains images with fourteen identified lung abnormalities. The goal is to develop a deep learning model capable of both classifying the type of anomaly and localizing its region within the image. Utilizing Python and CNN models, the student will explore various deep learning approaches to achieve accurate identification and localization of anomalies from normal X-ray images.",
    "Aneo: Ensambles for probabilistic forecasts of wind power production": "This project investigates probabilistic forecasting of wind power production for Aneo, a renewable energy company operating 11 wind farms. Utilizing machine learning (ML) with weather ensemble data, the thesis aims to improve forecast accuracy by incorporating multiple weather scenarios. Key tasks include data preparation, model building, and comparative analysis. The expected outcome is a robust methodology for probabilistic windpower forecasting, enhancing Aneo’s operational efficiency and profitability through more accurate day-ahead forecasts and uncertainty estimation.",
    "Aneo: Why do wind turbines fail?": "This master’s project investigates premature failures in Aneo’s wind turbine bushings, bearings, and gearboxes using existing vibration data and SCADA information. The aim is to automate root-cause analysis for improved maintenance decisions. Utilizing AI and machine learning algorithms, the student will identify key features from the data and implement automated methods. Technologies include data analysis, programming, and potentially Norwegian Open AI Lab (NAIL) resources. Expected outcomes are a robust system for predicting turbine failures and supporting operational optimization within Aneo’s renewable energy operations.",
    "Anomaly detection using foundational time-series models": "This project investigates anomaly detection within time series data using foundational models like Lag-Llama and TimesFM. The research aims to leverage these models’ zero/few-shot learning capabilities for real-time anomaly identification in applications such as machinery monitoring and fraud detection. Key activities include a state-of-the-art review, experimentation with the chosen models, and testing on live datasets. Expected outcomes are a functional zero/few-shot anomaly detection system demonstrating practical application.",
    "Artificial Intelligence, Cognitive Science, and Computer Games": "This project investigates cognitive functions through gameplay analysis using fMRI and artificial intelligence. The research utilizes a two-agent shooter game (SOL) to study human responses and brain activity in real-time. Technologies include fMRI, AI algorithms (potentially neural networks), and computer game development. Expected outcomes involve understanding how sensory stimuli impact cognitive function, personalized feedback’s effect on performance, and comparing human and AI reaction robustness. The project explores questions regarding player adaptation, agent behavior influence, and predicting cognitive test performance via gameplay data.",
    "Automatic Metadata Generation: Language Technology at the Interface of Spoken and Written Norwegian": "Automated metadata generation from transcribed Norwegian speech is the focus of this project, aiming to improve access and analysis of data for applications like accessibility and language evolution studies. The project will utilize NRK’s subtitled TV (NST) dataset or the ParlaMint-NO corpus, exploring fundamental algorithms for automated metadata generation. Technologies include text processing, AI/ML methods, and potentially speech recognition techniques. Expected outcomes are a functional AMG system, a repository optimized for AMG tasks, and insights into applying these methods to resource-constrained languages like Norwegian. The project contributes to advancing ASR and ML research while building competence among partners and disseminating findings openly.",
    "Application of artificial intelligence-based image soft-sensor to high temperature property study": "This project investigates utilizing artificial intelligence, specifically machine learning and deep neural networks, to analyze high-temperature material properties from images/videos captured in a sessile drop furnace. The research aims to develop an image soft-sensor for automated evaluation of wetting, softening, and melting kinetics within the SINTEF wetting lab. Technologies include super-resolution techniques and data pre-processing. Expected outcomes involve improved data digitalization, reduced operator deviation, and efficient analysis of thousands of high-temperature images/videos, ultimately enhancing material property assessment.",
    "Artificial Intelligence and Machine Learning wih Geophysical Applications": "This project investigates applying artificial intelligence (AI) and machine learning (ML) to geophysical data, particularly utilizing Distributed Acoustics Sensing (DAS) IoT sensors and high-performance computing (HPC). Research focuses on forecasting soil moisture, air quality, and related sustainability factors like landslides and CO2 storage using time-series ML models rooted in physically based hydrology. The project builds upon existing research at NTNU’s CGF center, leveraging available DAS data. Expected outcomes include developing novel algorithms for analyzing massive datasets, achieving spatial and seasonal generalizability, and enhancing model explainability – potentially focusing on parameter interpretation like soil drying/wetting rates. HPC skills and a multi-variate forecasting approach are highly desirable.",
    "Automated Single-Cell Type Annotation for Salmon Skin Disease Prevention": "This project develops an automated tool utilizing machine-learning algorithms (Python) for predicting single-cell types in salmon genomic samples to combat salmon skin disease. The collaboration with the University of Stirling aims to accelerate single-cell annotation, reducing manual costs and errors. Expected outcomes include a functional predictive tool, enhanced understanding of aquaculture practices through data analysis, and skill development in machine learning, bioinformatics, and interdisciplinary teamwork. The project will contribute to improved salmon health management within the aquaculture industry.",
    "Bloom's learning outcomes classification: comparative analysis of different LLMs potential": "This project investigates Large Language Models (LLMs) for classifying course learning objectives according to Bloom’s Taxonomy levels (remember, understand, apply, analyze, evaluate, create). Utilizing Python and machine/deep learning techniques, including prompt engineering, the research will design a model to compare LLM performance in identifying objective levels. The expected outcome is an assessment of LLMs' potential for accurate Bloom’s taxonomy classification, addressing limitations of verb-based approaches and contributing to improved educational resource organization.",
    "Comparing Synthetic to Real Alignment Data": "This project investigates the effectiveness of synthetic versus real alignment data for Norwegian Large Language Models (LLMs) within the TrustLLM and NorLLM projects. Utilizing both qualitative and quantitative evaluation methods, the research addresses concerns raised regarding data scarcity in AI development, particularly highlighted by the RAND Corporation’s report. The aim is to compare model outputs generated using synthetic and real data, ultimately determining the optimal approach for ensuring ethical alignment and addressing potential limitations of relying solely on limited datasets.",
    "Bio-Inspired Artificial Intelligence for Computer Games": "This project investigates bio-inspired AI, specifically evolutionary algorithms and novelty search, for generating engaging character mechanics within a simulated action game environment (SOL). The research aims to create an AI system that produces “fit” characters based on playability and human perception of interest. Utilizing adaptive stress testing and multi-objective genetic algorithms, the project explores alternative diversity preservation methods and a mixed-initiative design involving human designers. Expected outcomes include novel PCG techniques applicable across simulations and improved character mechanics in video games.",
    "Causal Inference for Headaches": "This project investigates causal inference techniques using AI to determine headache causes from patient records. The research will construct a causal graph, estimating the impact of variables on headache occurrence or remedy effectiveness. Technologies include probabilistic programming and Causal Inference methodologies. Expected outcomes involve modeling headache probability and remedy efficacy, informed by medical expert consultation. Prior coursework in AI, Probability Theory, and Causal Inference is required, alongside experience with medical data.",
    "Computational Creative Artform Transitions (e.g., Text to Images, Images to Music or Music to Text)": "This project explores computational creativity through transitions between creative artforms like text-to-image, image-to-music, or music-to-text generation. Utilizing technologies such as Stable Diffusion models, the research investigates automated processes of creative production, understanding, and evaluation. The expected outcome is a system capable of intelligently shifting between artistic mediums, potentially advancing computer systems’ ability to support and assess creative endeavors within fields including language, design, and music.",
    "Computational Linguistic Creativity": "This master’s project investigates computational linguistic creativity, focusing on either creating creative systems (poetry generation, joke translation) or analyzing human creative processes (humor detection, rhyme interpretation). The project could explore generating and evaluating computational poetry or translating online jokes between languages. Technologies involved include natural language processing and potentially machine learning. Expected outcomes include novel algorithms and insights into the nature of creativity in language.",
    "Computational nanosystems: Toward real word tasks": "This project investigates unconventional computing using artificial spin ice (ASI) as a computational substrate within the reservoir computing framework. Utilizing simulations with the flatspin simulator and exploring MNIST and spoken digit recognition tasks, the research aims to translate theoretical findings into real-world applications. The work leverages nanomagnet ensembles and connects to ongoing SOCRATES and SpinENGIN projects. Expected outcomes include defining efficient input encoding, ASI reservoir design, and readout strategies, ultimately demonstrating the potential of ASI for complex systems computation.",
    "Computational Creativity in Art, Images or Videos": "This project explores computational creativity in art, images, and videos, investigating how computers can generate novel and valuable outputs. Research will encompass systems recognizing/accessing creativity, tools assisting human creators (like Photoshop), and autonomous artistic programs such as AARON and Stable Diffusion. Technologies include image generation models and natural language processing for automated captioning. Expected outcomes involve developing or analyzing creative AI systems, potentially leading to new methods for generating art from textual or visual input and understanding the role of consumer perception in defining creativity.",
    "Computational Creativity with Reinforcement Learning and/or Generative Adversarial Networks": "This project investigates computational creativity using reinforcement learning (RL) and/or generative adversarial networks (GANs). The research explores leveraging RL with human feedback for tasks like language generation, potentially extending to art or music creation. GANs, primarily used in image generation, will also be examined as part of a creative system. Expected outcomes include developing novel methods for automated creative processes through intelligent agent behavior and exploring new approaches to generative models within the field of computational creativity.",
    "Computational Musical Creativity": "This project explores computational musical creativity using diverse techniques including rule-based systems, neural networks, and evolutionary methods for music composition, lyric generation, and music information retrieval. Research will investigate algorithmic composition spanning various genres and styles. Expected outcomes include novel approaches to automated music creation or analysis, potentially leveraging machine learning models. The thesis allows for student focus based on background and interests within this established field.",
    "Context-Aware Decoding using Multi-Lingual Language Models": "This project investigates context-aware decoding using multilingual language models to improve automated metadata generation from transcribed speech data, specifically utilizing the ParlaMint-NO corpus of Norwegian parliamentary minutes. The research aims to enhance access and analysis of this data by leveraging advancements in ASR and ML technologies. Utilizing existing language models, the project seeks to develop innovative solutions for Norwegian speech technology, contributing to broader research in ASR and under-resourced languages. Expected outcomes include improved metadata generation techniques and increased competence among project partners, ultimately supporting applications like digitalized public services and accessibility tools.",
    "Cool AI": "This project, supervised by Anders Kofod-Petersen, adopts a flexible approach, pursuing “sufficiently cool and difficult” AI problems or methods. The specific research area is undefined but centers around innovative AI solutions. Technologies utilized are unspecified, reflecting the open-ended nature of the proposal. Expected outcomes include the development and demonstration of a novel AI solution addressing a challenging problem.",
    "Computer Vision in Bad Weather conditions / Bad Visibility": "This master’s project investigates computer vision techniques for autonomous driving in challenging weather conditions like rain and snow. The research combines machine learning and classical computer vision methods to robustly detect vehicles, road markings, and obstacles under degraded visibility. It moves beyond simply improving image quality by incorporating image acquisition processes into algorithm design. Expected outcomes include novel algorithms that explicitly model or learn from image degradations for early object detection and 3D environment assessment. The project leverages an existing database and offers potential collaboration with a leading German industrial research laboratory, focusing on statistical signal processing and deep learning architectures.",
    "Context-aware language model integration in speech recognition": "This project investigates integrating context-aware language models into speech recognition systems to improve transcription accuracy. Utilizing NLP techniques like BERT/GPT and sequence-to-sequence models (LAS, wav2vec2, Whisper) with CTC decoding, the research aims to leverage contextual information from previous text during ASR decoding. The student will implement a baseline model and enhance it by tightly coupling a language model with the system, incorporating contextual data. Open-source datasets like the Norwegian Parliamentary Speech Corpus will be used. Expected outcomes include improved ASR performance through broader context utilization and exploration of state-of-the-art techniques in attention-based sequence to sequence models.",
    "Cross-Lingual Sentence Simplification with Large Language Models": "This project investigates cross-lingual sentence simplification using Large Language Models (LLMs) like NorLLM and TrustLLM. It addresses the challenge of preserving linguistic variation during translation by initially splitting complex sentences with LLMs, followed by fine-tuning on monolingual datasets and parallel corpora. The research aims to benchmark LLM performance against state-of-the-art models for one-to-many and many-to-one translation items. Expected outcomes include a refined approach to sentence simplification and improved cross-lingual translation quality through LLM adaptation.",
    "Detecting Social Media Risk Users": "This Master’s thesis investigates detecting at-risk users on social media, focusing on mental health issues (depression, suicide) and radicalization/predator targeting. Utilizing machine learning, including deep learning techniques, the project will analyze social media text data to identify risk indicators. Data collection will be a key component. Expected outcomes include developing and evaluating models for proactive identification of vulnerable individuals, contributing to improved safety measures and mental health support strategies.",
    "Digital Forensics": "This master’s project investigates digital forensics through analyzing writing style to identify authors and detect plagiarism. Research focuses on author profiling (age, gender, language proficiency), identification, and plagiarism detection – potentially utilizing machine learning techniques for automated analysis. The expected outcome is a framework for leveraging linguistic features to reveal user profiles, verify authorship, and combat academic dishonesty.",
    "Customized Master Projects in Basic Machine Learning Research": "This Master’s project offers flexible opportunities in basic machine learning research, aligning student interests with current challenges like algorithm development (supervised/unsupervised/reinforcement learning), theoretical investigations, and model optimization. Students will gain hands-on experience within a research-centric environment under Zhirong Yang's supervision at NTNU. Expected outcomes include developing technical skills, contributing to cutting-edge advancements, and potentially publishing research findings. Programming proficiency is essential for this exploratory project.",
    "Detection of security vulnerabilities in source code using machine learning": "This project investigates using machine learning to automatically detect security vulnerabilities in source code. Research will focus on recent advances in bug hunting via NLP, anomaly detection, or supervised classification techniques applied to open-source projects and CVE data. The aim is to build a model that annotates code with vulnerability warnings, potentially utilizing technologies like GitHub repositories and Exploitdb. Expected outcomes include identifying challenges in the field and demonstrating a trained model’s ability to analyze patched and unpatched code samples for vulnerabilities.",
    "Dense Monocular Depth Estimation for Unmanned Surface Vessels (in cooperation with Maritime Robotics)": "This project develops a real-time monocular depth estimation model for Unmanned Surface Vessels (USVs) in collaboration with Maritime Robotics. Utilizing deep learning, specifically exploring distillation of the DepthAnything model into a YOLO-based system, the research calibrates depth estimates using LIDAR and AIS data without human annotation. The target platform is the Jetson Orin NX, aiming to integrate seamlessly with the SeaSight system for autonomous operation testing on water. Expected outcomes include a deployable depth estimation solution enhancing situational awareness for USV navigation and control.",
    "E-Assessment in Higher Education with the Support of Large Language Models": "This project investigates the use of Large Language Models (LLMs) like ChatGPT, Palm, LLaMA, and Mistral for e-assessment in higher education. Utilizing Python and prompt engineering, researchers will train LLMs on course materials to generate question papers with varying difficulty levels and types. The study assesses model performance in creating assessments and scoring student responses, potentially including descriptive feedback. Expected outcomes include evaluating the impact of fine-tuning foundational models for enhanced e-assessment capabilities and exploring their application across diverse degree programs.",
    "Evolutionary Algorithms with Applications": "This project investigates evolutionary algorithms (EAs) for solving computationally hard problems and exploring their application in machine learning. Research will focus on improving EA efficiency through heuristic combinations and adaptive methods, potentially leveraging Markov chain analysis and high-performance computing to address the computational cost of ML with large datasets. The study aims to bridge theory and practice within AI/ML, examining formal modeling techniques for EAs. Expected outcomes include novel EA algorithms and insights into reducing the computational burden of machine learning applications.",
    "Dive into how models for animal classification & detection works under the hood": "This project investigates animal classification and detection using deep learning techniques within Python. Research focuses on fine-tuning object detection models, particularly localization methods like heatmap generation, to improve precision in dynamic “foggy” environments via synthetic data and augmentation. The study targets fish classification, underwater object detection, and re-identification, aiming to transfer findings to broader animal detection applications. Expected outcomes include a deeper understanding of model internals and enhanced performance through targeted loss function adjustments.",
    "Evaluating quantizations of large language models on edge systems": "This project investigates the application of quantizations to large language models (LLMs) for deployment on resource-constrained edge systems like the Nvidia Jetson TX2. The research will evaluate various quantization methods – including those recently proposed for LLMs – focusing on metrics such as quantization overhead, accuracy, and responsiveness. The goal is to assess the feasibility and efficiency of deploying LLMs like ChatGPT on edge devices, enabling functionalities without network connectivity.",
    "Examining Adaptation Shifting in Graph Domain Adaptation Tasks": "This project investigates adaptation shifting mechanisms within Graph Domain Adaptation (GDA) tasks, focusing on adaptation-based methods to address label scarcity and expensive individual graph training. The research will characterize domain shifts – structural, marginal, and task – in graph data and evaluate existing GDA techniques. Expected outcomes include novel metrics and visualization tools for measuring these shifts, insights into their impact on adaptation methods, and guidelines for selecting appropriate GDA models. Implementation involves literature review, dataset selection, algorithm development (including potential novel approaches), and comparative experimentation using graph embeddings.",
    "Exploring the design space of convolutional neural networks on edge systems": "This project investigates the design space of convolutional neural networks (CNNs) for Nvidia Jetson edge systems, focusing on accuracy, energy efficiency, and latency. The research explores the impact of CNN width, depth, and resolution within constrained resource environments. The goal is to define an effective design space for deploying CNNs on edge devices, ultimately leading to insights for designing efficient and effective CNN architectures tailored for low-power, real-time applications.",
    "Generating simulations that match data ​": "This project investigates hybrid AI for predictive maintenance in the energy sector, focusing on wind turbines and flow meters using likelihood-free Bayesian inference. It combines commercial simulation software with real industrial data to accelerate model identification and quantify uncertainty. The research will explore probability density estimation, stochastic differential equations, and compare classical and Bayesian uncertainties. Technologies include machine learning models and numerical solutions. Expected outcomes involve understanding Bayesian inference, quantifying model uncertainty, and developing improved predictive maintenance strategies through collaboration between SINTEF, Cognite, Kongsberg, and NorwAI.",
    "Explaining AI-based Recommendations (with Sparebank 1 SMN)": "This master’s project investigates Explainable AI (XAI) for analyzing deep neural network-based recommendation models within Sparebank 1 SMN. The candidate will explore methods to interpret model outputs and generate explanations for product recommendations using a dataset of 200,000 records. Technologies include deep learning and virtual machine access. Expected outcomes involve developing techniques to enhance employee understanding of AI-driven suggestions and contribute to the growing field of XAI in banking. Support provided by Stian Arntsen and Inga Strümke.",
    "Federated Learning for Privacy-Preserving Medical Image Analysis: A Collaborative Approach": "This project investigates using Federated Learning to enable privacy-preserving medical image analysis. The research focuses on training shared machine learning models across multiple healthcare institutions without exchanging raw patient data. Technologies utilized include federated learning and techniques for collaborative model aggregation. Expected outcomes involve improved diagnostic accuracy through decentralized data utilization while safeguarding sensitive patient information and minimizing data breach risks.",
    "Exploring Meta-Learning Strategies for Few-Shot Graph Learning Tasks": "This project explores meta-learning strategies for few-shot graph learning using Graph Neural Networks (GNNs). It investigates how to efficiently transfer knowledge across related graph tasks with limited labeled data, addressing the challenge of traditional graph learning’s high annotation costs. The research will analyze existing meta-learning paradigms and implement state-of-the-art methods, potentially developing novel algorithms tailored for GNNs. Expected outcomes include a comprehensive analysis of meta-learning approaches, insights into knowledge transfer, and visualization tools to interpret this process – ultimately providing guidelines for data-efficient graph learning applications.",
    "Generative AI applied to Medical Documents": "This project investigates applying Generative AI to medical document text mining for knowledge extraction. The aim is to develop a system capable of identifying relationships within medical documents and constructing a knowledge graph. Technologies utilized will include Artificial Intelligence, Machine Learning, and Natural Language Processing. Expected outcomes encompass a functional demonstrator showcasing the system’s ability to process and analyze medical data, ultimately supporting improved medical interventions and disease prevention strategies.",
    "Generative AI for Meta Data Inference (with DNB)": "This master’s project investigates using generative AI, specifically NLP pipelines and machine learning methods, to infer missing metadata from a large document archive provided by DNB. The goal is to automatically process documents into numeric representations for high-confidence estimates of metadata like document type and references. Utilizing public data sources alongside the DNB archive, the project aims to enrich the archive with valuable information, culminating in a robust NLP pipeline suitable for automated metadata inference.",
    "​Generating synthetic data​ (Sparebank1 SMN)": "This master’s project investigates generating synthetic banking data to overcome limitations of sharing sensitive real-world datasets. Utilizing methods like GANs, LLMs, and agent-based modeling, the goal is to create statistically accurate, anonymized data while retaining inference relationships. The research will explore synthesizing either aggregated or relational data – the latter presenting greater challenges but expanding use cases. Expected outcomes include a synthetic dataset mirroring original data’s statistical properties, facilitating broader data analysis and compute resource utilization outside of internal servers. Technologies involve data generation techniques and potentially cloud-based processing within a virtual machine environment.",
    "Graphics Content Generation for Ad Campaign:": "This project investigates leveraging Large Language Models (LLMs) to automate graphic content generation for ad campaigns. Utilizing Python and incorporating knowledge of GANs and Generative AI, the research aims to fine-tune LLMs for customized graphic output based on organizational descriptions. The expected outcome is a functional ad campaign generator utility evaluating its performance in producing tailored visual content, addressing the shortage of skilled graphic designers and reducing their workload within organizations.",
    "Generative AI for Customer Relationship Management (with Sparebank 1 SMN)": "This master’s project investigates the application of Generative AI, specifically Large Language Models (LLMs), to enhance Customer Relationship Management within Sparebank 1 SMN. The research will compare LLM performance against simpler models in categorizing customer messages from a dataset of over 400,000 emails and 160,000 chats (Norwegian). Expected outcomes include assessing the reliability of LLMs for improved customer service responsiveness and identifying potential competitive advantages for financial institutions.",
    "Improved Ambulance Response: Optimization": "This master’s project optimizes ambulance response times using data from the EMCC’s AMIS system (Akuttmedisinsk informasjonssystem). The research focuses on dynamically placing available ambulances based on factors like time of day, traffic, weather, and population density to balance resource allocation. Utilizing a dataset of 500,000 calls and 150,000 missions, the project employs predictive modeling techniques. Expected outcomes include reduced response intervals and improved ambulance resource utilization within the Oslo region (1.6 million population). Technologies involved include data analysis, spatial modeling, and potentially machine learning for prediction.",
    "Interesting AI Project": "This project seeks to align research interests of students with those of advisor Ole Jakob Mengshoel, focusing on previous research within his area. The project’s specifics are yet to be determined but will likely leverage AI technologies as outlined in Keith Downing's selection process (https://folk.idi.ntnu.no/keithd/ai-masters/kd-masters-selection.html). Expected outcomes involve a student-led research endeavor exploring relevant AI applications, requiring communication with potential advisors and sponsors.",
    "Human-Machine Symbiosis: How does decision-making change in the age of Big Data Analytics?": "This project investigates how Big Data Analytics impacts human decision-making. Utilizing neurophysiological data (eye-tracking & EEG) in collaboration with the Big Data Observatory, researchers will explore cognitive overload and biases influencing insight adoption. The study protocol design and data analysis will leverage expert knowledge of these technologies. Expected outcomes include identifying patterns in brain activity correlated with decisions based on analytical insights, ultimately contributing to understanding human-machine symbiosis in the age of big data.",
    "Identifying Online Hate Speech and Cyber Bullying": "This master’s project investigates automated identification of hate speech and cyberbullying within user-generated content platforms. Utilizing flame-annotated datasets from sources like Twitter, Wikipedia, and chat rooms, the research will explore machine learning methods for detecting abusive language. The goal is to improve upon existing manual moderation processes by developing faster, more efficient detection systems. Expected outcomes include a comparative analysis of various ML techniques and potentially a novel model for hate speech identification within online communities.",
    "Improved Ambulance Response: Prediction": "This master’s project aims to improve ambulance response times by predicting future emergency events using data from the Norwegian EMCC system (AMIS). The project will analyze anonymized data including location, time, event counts, and weather information to predict case loads and optimize resource allocation. Utilizing statistical modeling and potentially machine learning techniques, the research focuses on forecasting demand for ambulance services based on temporal patterns and external factors like traffic and climate. Expected outcomes include improved prediction accuracy for emergency events and ultimately, reduced response intervals, contributing to better patient outcomes within the Oslo region’s 1.6 million population.",
    "Machine Learning for Integrating Visual and Language Intelligence": "This project investigates integrating visual and language intelligence using machine learning techniques. Research focuses on improving image captioning performance by augmenting training datasets with paraphrased captions derived from the MS COCO dataset (490,000 paraphrased captions). The student will explore alternative ML models, embeddings, and data augmentation methods utilizing existing AI tools like Amazon’s recognition services and NTB’s extensive metadata-rich image archive (80 million images). Expected outcomes include improved image captioning models and potentially novel approaches to multimodal named entity recognition leveraging both textual and visual information.",
    "Machine Learning for Black-box Safety Validation of Autonomous Marine Vessels": "This project investigates safety validation of a Zeabuz autonomous ferry system using adaptive stress testing (AST) with reinforcement learning (RL). The student will utilize the mA2 digital twin in Trondheim to simulate operational scenarios and identify potential failure events within the autonomy system. Key technologies include the mA2 simulator, RL algorithms, and potentially multi-objective or constrained RL frameworks for AST. Expected outcomes are a systematic approach to safety testing and insights into weaknesses within the Zeabuz ferry’s autonomous operation, contributing to improved robustness and reliability.",
    "Language Technology and Large Language Models with Applications": "This project investigates language technology applications, particularly leveraging large language models (LLMs) like GPT and LLaMA for English and Norwegian languages. Research areas include dialogue generation, chatbots, and question generation utilizing datasets such as Google’s Coached Conversational Preference Elicitation and the Norwegian Dependency Treebank. The student will evaluate frameworks and explore potential collaborations with DNB to develop proof-of-concept solutions for automating internal processes. Expected outcomes involve analyzing language technology performance and identifying optimal use cases within resource-constrained languages, contributing to advancements in AI and ML applications.",
    "Memetic and Multimethod Stochastic Optimization Algorithms": "This project investigates stochastic optimization algorithms, specifically exploring the integration of evolutionary algorithms and stochastic local search (SLS) through memetic approaches. Research focuses on multimodal functions and their application to problems like feature selection, Bayesian network explanation, and signal processing. The core aims involve developing novel methods for balancing exploration and exploitation within these algorithms, potentially utilizing niching techniques and feedback control. Technologies include SLS, evolutionary algorithms (EAs), and machine learning methodologies. Expected outcomes are improved performance on computationally hard optimization problems, theoretical insights into stochastic optimization, and the development of a hybrid multi-method algorithm with demonstrable empirical results.",
    "Machine Learning for Effective Ocean Data Analysis": "This project investigates applying machine learning to 4D ocean data (currents, temperature, salinity, time) from sources like THREDDS and Barentswatch to identify patterns relevant to marine operations – pollution transport and aquaculture. Utilizing methods to uncover correlations within this complex dataset, the research aims to enable targeted period/area identification for risk assessment and operational planning. Technologies include various machine learning algorithms applied to netCDF data. Expected outcomes involve a novel approach to analyzing ocean data beyond traditional statistical methods, ultimately supporting informed decision-making in marine industries.",
    "Monitoring Norwegian nature loss with satellite imagery and AI": "This project investigates monitoring Norwegian nature loss using satellite imagery and AI. The aim is to improve upon existing maps by developing a local machine learning model – utilizing techniques like 3D CNNs, RNNs (LSTMs), and Transformers – that directly detects and maps ecological changes from multi-spectral, multi-temporal data. Leveraging over 10,000 annotated polygons, the project will test various model architectures to enhance environmental conservation efforts and provide a novel AI perspective on ecological monitoring.",
    "NeRFs - Neural Rendering and photorealistic Reconstruction of complex 3D scenes (2024)": "This project investigates Neural Radiance Fields (NeRFs) for photorealistic 3D scene reconstruction, leveraging techniques like Instant-NeRF, Block-NeRF, and F2-NeRF to enable persistent NeRF representation. The research explores applications in autonomous driving simulators (e.g., DRIVE Sim, Wayve) and VR/XR environments utilizing NVIDIA technology. Expected outcomes include experimentation with NeRFs and related frameworks (NeRF Studio, SDF Studio), contributing to advancements in real-time 3D rendering and scene understanding.",
    "MIC - Medical Image Computing / Analysis and AI/CV (most organs / most modalities) (2024)": "This project explores Medical Image Computing (MIC) utilizing Deep Learning (DL) and Computer Vision (CV) across diverse organs (heart, liver, brain, etc.) and imaging modalities (CT, MRI, Ultrasound, digital pathology). The focus involves developing and testing models, potentially including Vision Transformers (ViT), using the MONAI framework. Research will address challenges presented at conferences like MICCAI and CVPR. Expected outcomes include novel model development and contributions to advancing MIC research within a collaborative SINTEF Health/NTNU/St Olav University Hospital environment.",
    "MIC - Segmentation of anatomic structures in medical images": "This project investigates automated 3D medical image segmentation using modern neural networks, specifically focusing on applications like aorta, brain, and prostate segmentation in CT and MRI images. The research will utilize MONAI – Auto3Dseg to develop generic, state-of-the-art segmentation tools applicable across diverse datasets. Expected outcomes include achieving top performance results and creating adaptable segmentation solutions for various clinical tasks under the supervision of Gabriel Kiss and Frank Lindseth.",
    "Multimodal Personality Prediction": "This project investigates multimodal personality prediction using machine learning, specifically deep neural networks (DNNs), to analyze video interviews and social media profiles. The research focuses on predicting Big Five personality traits for recruitment purposes. Utilizing asynchronous video interviews and online data, the study aims to develop algorithms that overcome limitations of traditional questionnaires. Expected outcomes include improved accuracy in personality assessment and a more efficient recruitment process through automated analysis.",
    "Non-destructive reconstruction of 3D objects using machine learning": "This project investigates improved 3D reconstruction of CT scans using machine learning techniques, specifically implicit neural representation, which has shown state-of-the-art results surpassing traditional methods. The research aims to enhance the quality of 3D models for applications in medicine, earth science, and material science. Utilizing computed tomography (CT) imaging, the project will explore novel AI approaches to achieve superior reconstruction accuracy. Expected outcomes include a refined understanding of machine learning’s potential within CT image processing and potentially new research directions for future investigations.",
    "Pedagogical chat bot": "This project develops a domain-specific conversational AI chatbot for educational purposes, targeting a Hyper Interactive Intelligent Presenter. Utilizing deep learning techniques to train the bot on course material, it aims to assist users in acquiring basic knowledge and querying relevant resources. The research focuses on evaluating the bot’s performance through diverse queries. Expected outcomes include a functional chatbot prototype demonstrating effective domain-specific conversational AI.",
    "Neural Radiance Fields (NeRF) for real time 3D-reconstruction (H2024-V2025)": "This project investigates applying Neural Radiance Fields (NeRF) for real-time 3D reconstruction within simultaneous localization and mapping (SLAM) problems. Utilizing NVIDIA’s recent advancements that drastically reduce NeRF training time, the research aims to reconstruct 3D environments from real-time video streams. The core technology involves leveraging a multi-layer perceptron network and ray tracing techniques. Expected outcomes include demonstrating real-time NeRF implementation for SLAM applications, potentially enabling dynamic environment mapping with significantly improved speed compared to previous methods.",
    "On-device personalization of large language models on edge devices": "This project investigates on-device personalization of large language models (LLMs) for resource-constrained edge devices like mobile phones and autonomous vehicles. Utilizing a hardware-aware approach, the research aims to reduce LLM complexity and latency through personalized model adaptation – akin to CNN personalization – performed directly on the device. The core technologies involve LLMs and optimization techniques for low-overhead execution. Expected outcomes include an efficient method for tailoring LLMs to specific user needs while maximizing performance within edge system limitations.",
    "Personalized Health": "This master’s project explores Personalized Health through the implementation of recommender systems to optimize medical interventions for individual patients. The research focuses on areas like nutrition, exercise, medication, and therapy. Utilizing Artificial Intelligence, Machine Learning, and Recommender Systems, the candidate will develop a system that narrows down intervention options based on user profiles. Expected outcomes include a functional demonstrator and insights into personalized healthcare strategies, leveraging medical data and programming skills.",
    "Probabilistic models for Generative AI": "This master's project investigates probabilistic models for generative AI, primarily focusing on diffusion models alongside related techniques like Bayesian flow networks. The research will explore comparative studies between different generative model architectures (e.g., diffusion vs. GANs/VAEs) across diverse data types – images, video, time series, and graphs. Expected outcomes include a theoretical understanding of these models and potentially a practical application utilizing a chosen dataset.",
    "Pseudo labelling of medical data": "This project investigates pseudo-labeling of medical data, specifically chest x-rays, to address annotation scarcity in datasets like ISU. Utilizing transfer learning and deep learning models, the research aims to generate synthetic labels (pseudolabels) from the VinDR dataset or similar sources for training diagnostic models. The expected outcome is a trained model capable of identifying abnormalities, potentially improving diagnostic accuracy where expert annotations are limited.",
    "Predicting Social Media Personalities, Values and Ethics": "This master’s project investigates the relationship between social media usage, personality traits, and ethical values. Utilizing models like Schwartz' Values and Goldberg’s Big Five, the research will analyze user text and network data to determine how personalities are reflected in online behavior. Technologies involved include natural language processing and social network analysis. Expected outcomes include a predictive model identifying correlations between social media characteristics and individual values/ethics, contributing to understanding online personality dynamics.",
    "Prediksjon av råvarepriser": "This project investigates predicting commodity prices using machine learning and artificial intelligence techniques. The research will target markets experiencing or anticipating exponential growth. Key technologies include machine learning algorithms applied to analyze market dynamics and forecast price fluctuations. Expected outcomes encompass developing predictive models for raw material pricing, contributing insights for investment strategies and risk management within volatile markets.",
    "Problems in bioinformatics": "This project explores using computational models to predict gene regulation’s impact on development and disease. Research focuses on developing custom algorithms, statistical simulations, and machine learning techniques – including genetic programming (GP) and support vector machines (SVMs) – for analyzing biological data. The aim is to identify microRNA target sites, microRNA genes, and related proteins. Expected outcomes include novel predictive models and contributions to bioinformatics research utilizing programming, machine learning, and string search algorithms.",
    "Short-term planning for inspection drone using reinforcement learning": "This project investigates autonomous inspection drone path planning for industrial tanks utilizing reinforcement learning (RL). The research focuses on training an RL model to generate short-term, collision-free paths between predefined waypoint coordinates within a 3D environment. A hybrid approach combining RL with Model Predictive Control (MPC) is proposed. Expected outcomes include a planning module capable of simulating efficient drone routes for receding horizon predictive control, contributing to autonomous inspection processes.",
    "Social Robotics: HCI in Norwegian": "This project investigates Human-Robot Interaction (HRI) within Social Robotics, focusing on developing robots capable of communicating in Norwegian and English. Utilizing audio-visual sensors through NorwAI Center’s robotic platform, the research aims to create new functionalities for complementary human assistance. The candidate will leverage a modular backend and contribute to implementing and evaluating NLP solutions. Expected outcomes include enhanced robot communication capabilities and potential event demonstrations for evaluation, requiring strong programming skills and an interest in HCI.",
    "Sentiment and/or Figurative Language Analysis in Social Media": "This project investigates automatic sentiment analysis of social media text, specifically focusing on challenges posed by negation and figurative language (sarcasm, irony, metaphor) within tweets. Utilizing techniques in language technology, the research aims to classify sentiment—positive or negative—regarding products, people, or political parties. The project will identify a dataset rich in figurative language to assess its impact on traditional lexical-based sentiment analysis methods and determine the degree of expressed sentiment.",
    "Simulating Language and Communication Evolution": "This project investigates language and communication evolution through computational modeling. Utilizing evolutionary algorithms or reinforcement learning, it aims to simulate dynamic changes in language dynamics within social settings, potentially addressing limitations of traditional small population simulations. The research focuses on creating “language games” to explore communicative processes and origins of languages. Expected outcomes include insights into the main drivers of linguistic evolution and a refined approach to simulating larger, more realistic language populations.",
    "Software-enabled operational efficiencies in a global software scale-up": "This project investigates leveraging large language models and generative AI to enhance operational efficiencies within a global software scale-up – Kantega SSO AS. The research focuses on developing solutions for customer support and troubleshooting using data from this rapidly growing Atlassian security solution provider. Key technologies include large language models and generative AI. Expected outcomes involve identifying and implementing AI-driven processes to improve support operations and streamline troubleshooting, ultimately boosting operational efficiency within the company.",
    "Sports Video Analytics": "This project investigates sports video analytics, specifically predicting baseball/cricket shot power, drive type, and bat angle from video footage. Utilizing computer vision techniques and Vision Transformers (including deep learning), the student will develop models to analyze labelled data within a newly created database. The expected outcome is the creation of predictive models for these key performance metrics, enhancing sports analytics through automated visual analysis.",
    "Text Mining on Medical Documents": "This master’s project investigates text mining of medical documents to extract valuable information for improved healthcare interventions. The project will develop a system utilizing Artificial Intelligence, Machine Learning, and Natural Language Processing techniques to identify relationships within documents and generate knowledge graphs. Expected outcomes include a functional demonstrator showcasing the system's capabilities and contributing to advancements in medical data analysis.",
    "Sparse Neural Attention": "This project investigates “Sparse Neural Attention,” aiming to develop a more efficient self-attention model than traditional Transformers. The research focuses on reducing computational costs associated with attention mechanisms while maintaining strong transformation capabilities. Technologies utilized include neural networks and sparse computation techniques. Expected outcomes involve a novel model tested across diverse datasets, ultimately addressing the high cost of current attention models in practical applications.",
    "Solving Cryptic Crosswords with Large Language Models": "This project investigates utilizing Large Language Models (LLMs) to solve cryptic crosswords, a task requiring complex reasoning currently dominated by human solvers. The research will benchmark NorwAI LLMs against state-of-the-art models, aiming to improve accuracy beyond current 8.9% performance. Key technologies include LLMs and synthetic dataset generation (English & Norwegian). Expected outcomes encompass refined benchmarking methods and the creation of a Norwegian cryptic crossword dataset, ultimately exploring LLM capabilities in challenging reasoning problems.",
    "Stochastic Local Search: Algorithms and Applications": "This project investigates Stochastic Local Search (SLS) algorithms for computationally hard problems like SAT and sparse signal recovery. Research will explore improving SLS through heuristics, bio-inspired AI, and potentially Markov chain analysis to reduce computational cost in machine learning applications such as feature selection. The goal is to develop more efficient SLS methods suitable for large datasets. Expected outcomes include theoretical advancements in SLS and practical algorithms with improved performance across diverse problem domains. Technologies involved include evolutionary algorithms, stochastic optimization, and possibly high-performance computing.",
    "Topological Methods for Condition Monitoring in Heavy Asset Industries (with Cognite)": "This project investigates condition monitoring in heavy asset industries using Topological Data Analysis (TDA) alongside Python programming. It addresses limitations of deep learning by offering explainable insights into equipment failure patterns through algebraic topology – specifically persistent homology and cohomology – applied to industrial datasets provided by Cognite. The research aims to identify subtle, non-linear relationships indicative of early failures in systems like wind turbines and oil &amp gas pipelines. Expected outcomes include improved predictive models, enhanced accuracy in failure predictions, and the development of data pipelines for assessing equipment health compared to traditional deep learning methods.",
    "Uncertainty Quantification for Language Models in Safety-Critical Systems": "This project investigates Uncertainty Quantification (UQ) for Language Models in safety-critical systems, addressing reliability concerns due to their inherent stochasticity and lack of transparency. The student will explore deep learning, Tsetlin machines, and probabilistic models alongside benchmark datasets like Datasets to evaluate UQ techniques for text generation and summarization tasks. The research aims to develop scalable methods for capturing nuanced uncertainties within Language Models, mitigating issues such as hallucination and misinformation. Expected outcomes include a critical assessment of existing UQ approaches and recommendations for improving their application in AI-based systems, particularly within the context of risk management and assurance, aligning with DNV’s digital assurance program.",
    "Training video generation with sensor and Generative AI": "This project investigates generating personalized rehabilitation training videos using sensor data and Generative AI. The research focuses on leveraging sensor input to create “avatar” videos and training a generative AI model to produce customized video content based on patient practice. Key technologies include sensor data analysis and Generative AI. Expected outcomes involve a system capable of dynamically creating tailored training videos, addressing the limitations of standardized therapeutic materials and improving patient rehabilitation support.",
    "TrønderEnergi: Explainable time-series forecasting": "This project investigates explainable time-series forecasting for TrønderEnergi’s operational systems, utilizing consumption, grid loss, weather, and production data (5+ years). The aim is to provide domain experts with understandable explanations of machine learning forecasts, addressing their need for insight beyond the raw output. Prototype development and expert evaluation will focus on improving existing deployed forecasting models. Expected outcomes include enhanced decision-making capabilities through increased forecast transparency and trust.",
    "Uncertainty Quantification in Detection and Classification Problems": "This project investigates uncertainty quantification in deep learning classifiers for boat detection and classification, addressing the risk of confidently incorrect predictions. The student will explore methods like Bayesian deep learning and Evidential deep learning, testing their performance with manipulated images from existing datasets (DNV dataset, CIFAR-10/100, RETINA). Research focuses on identifying factors influencing uncertainty and distinguishing between epistemic and aleatoric uncertainty. Expected outcomes include a deeper understanding of classifier weaknesses and the development of AI models capable of recognizing distributional shifts and expressing meaningful uncertainty, ultimately supporting safer decision-making in high-risk industries through improved digital assurance.",
    "Vision Transformers (for Visual Intelligence) (2024)": "This project investigates Vision Transformers (ViTs), a rapidly growing area leveraging transformers for computer vision, building upon successes in Natural Language Processing. The research will combine theoretical understanding of ViT architectures with practical application in domains like autonomous vehicles and medical image analysis. Utilizing technologies such as transformers and ViTs, the project aims to explore state-of-the-art methods and potentially develop novel applications. Expected outcomes include a comprehensive understanding of ViTs and their implementation within relevant fields.",
    "Uncertainty-aware Deep Learning a.k.a. Deep Bayesian Learning": "This master’s project explores uncertainty-aware deep learning, extending traditional deep learning with probabilistic reasoning. Utilizing frameworks like TensorFlow Probability and Pyro (built on PyTorch), students will investigate incorporating Bayesian methods into deep learning models for applications such as image classification and recommender systems. The research demands a strong foundation in linear algebra, statistics, machine learning, and deep learning, alongside practical implementation skills within chosen frameworks. Expected outcomes include developing and evaluating novel uncertainty-aware deep learning techniques, contributing to theoretical advancements in the field.",
    "Using causal information to improve generative models": "This project investigates leveraging causal information to improve generative models, specifically Variational Autoencoders (VAEs). The aim is to create more controllable generation by disentangling code-space dimensions – for example, relating “smiling” to a specific dimension in a human face dataset. Utilizing knowledge representation of interdependencies between variables (e.g., gender and hair length), the project will explore techniques like CausalVAE to enable interventions without unintended consequences. Expected outcomes include enhanced generative quality and insights into the trade-off between side information requirements and generation performance.",
    "Vision Mamba for Advanced Medical Image Analysis": "This project investigates Vision Mamba (ViM), a State-Space Model architecture, for advanced medical image analysis as an alternative to CNNs and ViTs. The research will explore ViM’s theoretical advantages and practical implementation using existing architectures on medical datasets. Goals include benchmarking performance against established methods and potentially developing novel ViM adaptations. Utilizing Mamba models from arXiv papers, the project aims to demonstrate ViM's potential for improved long-range dependency modeling in medical imaging tasks, ultimately contributing to advancements in image analysis technology.",
    "Virtual, Augmented and Mixed Reality for learning AI etc. (2024)": "This project explores the application of Virtual Reality (VR), Augmented Reality (AR), and Mixed Reality (MR) to enhance learning experiences in areas like Artificial Intelligence (AI), Machine Learning (ML), and Deep Learning (DL). The research will investigate XR’s potential for training, potentially utilizing technologies such as Unity or Unreal Engine. Expected outcomes include a demonstration of an XR-based learning module and insights into the effectiveness of immersive environments for knowledge acquisition and skill development within complex technical fields.",
    "Designing design systems for remote operations": "This master’s project investigates designing design systems for remote operations across domains like unmanned surface vessels and drones, aligning with the OpenRemote initiative. The student will utilize a human-centered design approach to create documented UI elements, visual guidelines, and design principles, mirroring established systems like Material Design. Expected outcomes include a functional design system prototype and evaluation of its usability, aiming to improve design consistency and reduce development time within remote operation digital products. Technologies involved encompass UI design and prototyping.",
    "Designing eco-feedback interfaces for ships": "This project investigates designing eco-feedback interfaces for ships to reduce carbon emissions within maritime operations. Utilizing behavioral science principles like nudging, it will explore adapting automotive eco-feedback mechanisms to the shipping context through concept development and prototyping. The research involves user engagement and stakeholder collaboration to create practical, effective, and user-friendly systems. Expected outcomes include innovative interface designs promoting sustainable ship operation behaviors and contributing to a greener future for the maritime industry.",
    "Visual Creativity / Generative Visual AI / multi-modal foundation models (2024)": "This master’s project investigates generative visual AI models for content creation, exploring text-to-image, video, and 3D generation techniques like DALL-E 3, Stable Diffusion, and Imagen. The research will examine emerging multi-modal foundation models potentially incorporating audio/music generation. Expected outcomes include a practical project with identified application areas, utilizing technologies such as Sora, Stable Video Diffusion, and Gen 3D.",
    "XAI og bakdører i maskinlæringsmodeller": "This project investigates backdoor planting in machine learning models, building upon recent cryptographic findings. The student will reproduce the results and explore methods for detecting and introducing these backdoors, potentially utilizing Explainable AI (XAI) techniques. Technologies involve machine learning model analysis and cryptography. Expected outcomes include a deeper understanding of backdoor vulnerabilities, investigation into detection strategies, and exploration of alternative insertion methods. Collaboration with mathematics institute students and PhD candidates is anticipated.",
    "Designing user interfaces for drone swarm interaction": "This project investigates designing user interfaces for controlling drone swarms, addressing challenges in efficient swarm management. Research will explore current drone swarm control methods and conduct operator needs analysis to inform intuitive interaction models. Prototyping and user testing will develop responsive and effective control systems for both onsite and remote operation setups. The expected outcome is enhanced swarm control through innovative UI design, ultimately improving the usability and effectiveness of drone swarms.",
    "Effects of fully immersive VR games for people with intellectual disability": "This project investigates the impact of fully immersive virtual reality (VR) games on individuals with intellectual disabilities, recognizing their reliance on repetition for learning. The research aims to explore VR’s potential as a tool for social workers to teach complex tasks and support diverse functional abilities within this dispersed population. Utilizing VR technology, the study will assess the effects of practice through immersive gaming, contributing valuable insights into effective learning methodologies for individuals with intellectual disabilities and potentially improving task acquisition.",
    "Designing user interfaces for sail propulsion": "This project investigates designing user interfaces for sail propulsion systems in large vessels, aligning with the OpenZero initiative. Research will encompass existing sail interface patterns and user needs through surveys and prototyping. The aim is to develop intuitive UIs that optimize the operation of sail-supported ships, addressing a current gap in maritime design. Technologies involved include UI/UX design tools and potentially sensor integration for data visualization. Expected outcomes are validated UI designs enhancing operability, efficiency, and ultimately contributing to sustainable shipping practices.",
    "Mestringslæring i Intro programmering": "This master’s project investigates the application of mastery learning in introductory programming education. Conducted by Joakim Pettersen Vassbakk under the supervision of Guttorm Sindre, the research will explore a specific teaching model utilizing mastery learning.  Expected methods include quantitative and qualitative data collection to assess its effectiveness. The project focuses on informatics didactics, potentially employing various technologies for data analysis and student interaction assessment."
  },
  "originalDataFile": "projects-2025-03-26T21-11-06-367Z.json",
  "generatedAt": "2025-03-26T21:52:30.808Z",
  "totalSummaries": 328
}